Repository: LazZiya/ExpressLocalizationSampleCore3
Catalog: ExpressLocalizationSampleCore3Mvc/LocalizationResources/ExpressLocalizationResource.*.resx
Languages: cs, fa, nl, ru, tr

source: A non-empty request body is required.
cs: Požaduje se non-prázdná Tělo požadavku.
fa: درخواست بدن غیر خالی مورد نیاز است.
nl: Een niet-leeg-verzoek is vereist.
ru: Требуется непустое тело запроса.
tr: İstek gövdesi boş olmamalı

source: A user with this login already exists.
cs: Uživatel s tímto přihlašovacím jménem již existuje.
fa: کاربر به این سیستم وارد قبل وجود دارد.
nl: Een gebruiker met deze login bestaat al.
ru: Пользователь с таким логином уже существует.
tr: Bir harici giriş zaten bu hesaba bağlıdır.

source: A value for the '{0}' parameter or property was not provided.
cs: Hodnota pro ‚{0}‘ parametr nebo vlastnost není k dispozici.
fa: مقدار برای {0} 'پارامتر یا اموال ارائه نشده است.
nl: Een waarde voor de '{0}' parameter of eigenschap werd niet verstrekt.
ru: Не было представлено значение для '{0}' параметра или свойства.
tr: '{0}' alanı değer içermiyor

source: A value is required.
cs: Hodnota je vyžadována.
fa: مقدار مورد نیاز است.
nl: Een waarde is verplicht.
ru: Требуется значение.
tr: Değer gerekli

source: An unknown failure has occurred.
cs: Neznámé selhání došlo.
fa: خطای ناشناختهای رخ داده است.
nl: Een onbekende opgetreden.
ru: Произошла неизвестная ошибка.
tr: Kullanıcı yönetim sistemi hatası.

source: Both ErrorMessageResourceType and ErrorMessageResourceName need to be set on this attribute.
cs: Oba ErrorMessageResourceType a ErrorMessageResourceName je třeba nastavit na tento atribut.
fa: هر دو ErrorMessageResourceType و ErrorMessageResourceName نیاز به این ویژگی تنظیم شود.
nl: Zowel ErrorMessageResourceType en ErrorMessageResourceName moeten worden ingesteld op deze eigenschap.
ru: Для этого атрибута должны быть установлены как ErrorMessageResourceType, так и ErrorMessageResourceName.
tr: Hem ErrorMessageResourceType hem de ErrorMessageResourceName öğesinin bu nitelikte ayarlanması gerekir.

source: Cannot retrieve property '{0}' because localization failed. Type '{1}' is not public or does not contain a public static string property with the name '{2}'.
cs: Nelze načíst vlastnosti ‚{0}‘, protože lokalizace selhal. Typ ‚{1}‘ není veřejný ani neobsahuje public static string vlastnost s názvem ‚{2}‘.
fa: می توانید بازیابی اموال نیست '{0} "به دلیل محلی سازی شکست خورده است. نوع '{1}' 'عمومی است یا فاقد یک اموال عمومی استاتیک رشته با نام نیست {2}.
nl: Kan niet ophalen eigenschap '{0}', omdat lokalisatie is mislukt. Type '{1}' is niet openbaar is of niet een openbare statische eigenschap string met de naam bevatten '{2}'.
ru: Невозможно получить свойство '{0}', потому что локализация не удалось. Тип '{1}' не является общедоступным или не содержит публичное статическое строковое свойство с именем '{2}'.
tr: Yerelleştirme başarısız olduğu için '{0}' özelliği alınamıyor. '{1}' türü genel değil veya '{2}' adlı bir genel statik dize özelliği içermiyor.

source: Confirm password
cs: Potvrďte heslo
fa: تکرار رمز عبور
nl: Bevestig wachtwoord
ru: Подтверждение пароля
tr: Şifreyi tekarla

source: Could not convert the value of type '{0}' to '{1}' as expected by method {2}.{3}.
cs: Nelze převést hodnotu typu '{0}' do '{1}' podle očekávání metodou {2}. {3}.
fa: این مقدار از نوع تبدیل کند '{0}' به '{1}' به عنوان انتظار می رود با استفاده از روش {2} {3}.
nl: Zou de waarde van het type niet converteren '{0}' tot {1} 'zoals verwacht Werkwijze {2}. {3}.
ru: Не удалось преобразовать значение типа '{0}' в '{1}', как ожидалось по методу {2}. {3}.
tr: '{0}' türünün değeri, {2}. {3} yöntemi tarafından beklendiği gibi '{1}' değerine dönüştürülemedi.

source: Could not find a property named {0}.
cs: Nelze najít vlastnost s názvem {0}.
fa: می تواند یک ویژگی به نام {0} را پیدا کند.
nl: Kan een eigenschap met de naam {0} niet vinden.
ru: Не удалось найти свойство с именем {0}.
tr: {0} adlı bir özellik bulunamadı.

source: Date
cs: datum
fa: تاریخ
nl: Datum
ru: Дата
tr: Tarih

source: Either ErrorMessageString or ErrorMessageResourceName must be set, but not both.
cs: Buď ErrorMessageString nebo ErrorMessageResourceName musí být nastavena, ale ne obojí.
fa: در هر دو صورت ErrorMessageString یا ErrorMessageResourceName باید تنظیم شود، اما نه هر دو.
nl: Ofwel ErrorMessageString of ErrorMessageResourceName moet worden ingesteld, maar niet beide.
ru: Либо ErrorMessageString или ErrorMessageResourceName должны быть установлены, но не оба.
tr: ErrorMessageString veya ErrorMessageResourceName ayarlarının yapılması gerekir, ancak ikisi birden değil.

source: Email
cs: E-mailem
fa: پست الکترونیک
ru: Эл. адрес
tr: Eposta

source: Email '{0}' is already taken.
cs: Email '{0}' je již obsazen.
fa: ایمیل {0} 'قبلا گرفته شده است.
nl: E-mail '{0}' is al in gebruik.
ru: Эл. адрес '{0}' уже занят.
tr: Eposta adresi '{0}' önceden kayıtlıdır

source: Email '{0}' is invalid.
cs: Email '{0}' je neplatná.
fa: ایمیل {0} 'نامعتبر است.
nl: E-mail '{0}' is ongeldig.
ru: Эл. адрес '{0}' является недействительным.
tr: Eposta adresi '{0}' geçerli değildir.

source: ID
fa: شناسه
nl: ID kaart
tr: Kimlik

source: Incorrect password.
cs: Nesprávné heslo.
fa: رمز ورود اشتباه است.
nl: Incorrect wachtwoord.
ru: Неверный пароль.
tr: Yazdığınız şifre hesabınızda kayıtlı olan şifre ile eşleşmiyor.

source: Invalid token.
cs: Neplatný token.
fa: کد نامعتبر.
nl: Ongeldige Token.
ru: Недопустимый токен.
tr: Doğrulama kodu geçerli değildir.

source: IsValid(object value) has not been implemented by this class. The preferred entry point is GetValidationResult() and classes should override IsValid(object value, ValidationContext context).
cs: IsValid (hodnota objektu) nebyla provedena touto třídou. Preferovaný přístupový bod je GetValidationResult () a Třídy by měly potlačit isValid (hodnotový objekt, ValidationContext kontext).
fa: IsValid (ارزش شی) توسط این کلاس اجرا نشده است. نقطه ورود را ترجیح داده است GetValidationResult () و کلاس باید IsValid (ارزش شی، ValidationContext زمینه) زیر پا بگذارند.
nl: IsValid (object-waarde) niet is geïmplementeerd door deze klasse. De geprefereerde ingangspunt is GetValidationResult () en klassen moeten overschrijven IsValid (objectwaarde, ValidationContext context).
ru: IsValid (значение объекта) не был реализован этим классом. Предпочтительная точка входа GetValidationResult () и классы должны переопределить IsValid (значение объекта, ValidationContext контекст).
tr: IsValid (nesne değeri) bu sınıf tarafından uygulanmadı. Tercih edilen giriş noktası GetValidationResult () 'dir ve sınıflar IsValid'i (nesne değeri, ValidationContext bağlamı) geçersiz kılmalıdır.

source: Lockout is not enabled for this user.
cs: Uzamčení není povolen pro tohoto uživatele.
fa: تحریم برای این کاربر فعال نیست.
nl: Lockout is niet ingeschakeld voor deze gebruiker.
ru: Блокировка не включена для этого пользователя.
tr: Kullanıcı kilidi aktif değildir.

source: MaxLengthAttribute must have a Length value that is greater than zero. Use MaxLength() without parameters to indicate that the string or array can have the maximum allowable length.
cs: MaxLengthAttribute musí mít hodnotu délku, která je větší než nula. Použití MaxLength () bez parametrů pro indikaci, že řetězec nebo pole může mít maximální přípustnou délku.
fa: MaxLengthAttribute باید یک مقدار طول این است که بزرگتر از صفر است. استفاده از MAXLENGTH () بدون پارامتر نشان می دهد که رشته یا آرایه می تواند حداکثر طول مجاز است.
nl: MaxLengthAttribute moet een lengte waarde die groter is dan nul. Gebruik MaxLength () zonder parameters aan te geven dat de kolom of matrix de maximaal toelaatbare lengte kan hebben.
ru: MaxLengthAttribute должен иметь значение длины, которое больше нуля. Используйте MaxLength () без параметров, чтобы указать, что строка или массив может иметь максимально допустимую длину.
tr: MaxLengthAttribute, sıfırdan büyük bir Uzunluk değerine sahip olmalıdır. Dize veya dizinin izin verilen maksimum uzunluğa sahip olduğunu belirtmek için parametreler olmadan MaxLength () kullanın.

source: MetadataClassType cannot be null.
cs: MetadataClassType nemůže být null.
fa: MetadataClassType نمی تواند تهی.
nl: MetadataClassType kan niet null zijn.
ru: MetadataClassType не может быть пустым.
tr: MetadataClassType boş olamaz.

source: MinLengthAttribute must have a Length value that is zero or greater.
cs: MinLengthAttribute musí mít hodnotu délku, která je nulová nebo vyšší.
fa: MinLengthAttribute باید یک مقدار طول است که صفر یا بیشتر باشد.
nl: MinLengthAttribute moet een lengte waarde die nul of meer.
ru: MinLengthAttribute должен иметь значение длины, что равен нулю или больше.
tr: MinLengthAttribute, sıfır veya daha büyük olan bir Uzunluk değerine sahip olmalıdır.

source: Name
cs: název
fa: نام
nl: Naam
ru: Имя
tr: Ad

source: Optimistic concurrency failure, object has been modified.
cs: Selhání optimistická souběžnost, objekt byl změněn.
fa: شکست همزمانی خوش بینانه، شی اصلاح شده است.
nl: Optimistische mislukking, is object is gewijzigd.
ru: Ошибка оптимистичного параллелизма, объект был изменен.
tr: Eş-zamanlama hatası.

source: Password
cs: Heslo
fa: کلمه عبور
nl: Wachtwoord
ru: Пароль
tr: Şifre

source: Passwords must be at least {0} characters.
cs: Hesla musí mít alespoň {0} znaků.
fa: کلمه عبور باید حداقل {0} کاراکتر باشد.
nl: Wachtwoorden moeten minimaal {0} tekens.
ru: Пароли должны содержать не менее {0} символов.
tr: Şifre en az '{0}' karakter uzunluğunda olmalı.

source: Passwords must have at least one digit ('0'-'9').
cs: Hesla musí mít alespoň jednu číslici ( ‚0‘ - ‚9‘).
fa: کلمه عبور باید حداقل یک رقم (- '9' '0') دارند.
nl: Wachtwoorden moeten ten minste één cijfer (- '9' '0') hebben.
ru: Пароли должны содержать по крайней мере одну цифру.
tr: Şifre rakam içermelidir (0 - 9).

source: Passwords must have at least one lowercase ('a'-'z').
cs: Hesla musí mít alespoň jedno malé ( ‚a‘ - ‚z‘).
fa: کلمه عبور باید حداقل یک حرف کوچک (- 'الف' 'A') داشته باشد.
nl: Wachtwoorden moeten ten minste één kleine (- 'z' 'a') hebben.
ru: Пароли должны иметь хотя бы одну строчную букву ('a'-'z').
tr: Şifre küçük harf içermelidir (a - z).

source: Passwords must have at least one non alphanumeric character.
cs: Hesla musí mít alespoň jeden non alfanumerický znak.
fa: کلمه عبور باید حداقل یک نویسه غیر حرفی دارند.
nl: Wachtwoorden moeten ten minste één niet alfanumeriek teken hebben.
ru: Пароли должны содержать хотя бы один не буквенно-цифровой символ.
tr: Şifre harf-rakam olmayan karakterler içermelidir (! + . - ? ...)

source: Passwords must have at least one uppercase ('A'-'Z').
cs: Hesla musí mít alespoň jedno velké ( ‚A‘ - ‚Z‘).
fa: کلمه عبور باید حداقل یک حرف بزرگ (- 'Z' 'A') داشته باشد.
nl: Wachtwoorden moeten tenminste één hoofdletter (- 'Z' 'A') hebben.
ru: Пароли должны содержать хотя бы одну заглавную букву ('A'-'Z').
tr: Şifre büyük harf içermelidir (A - Z).

source: Passwords must use at least {0} different characters.
cs: Hesla se musí používat alespoň {0} odlišné charakteristiky.
fa: کلمه عبور باید حداقل {0} شخصیت های مختلف استفاده کنید.
nl: Wachtwoorden moeten minimaal {0} verschillende karakters te gebruiken.
ru: Пароли должны содержать не менее {0} разных символов.
tr: Şifre en az '{0}' benzersiz karakter içermelidir.

source: Price
cs: Cena
fa: قیمت
nl: Prijs
ru: Цена
tr: Fiyat

source: Recovery code redemption failed.
cs: Recovery kód vykoupení selhal.
fa: بازیابی کد فعال سازی شکست خورده است.
nl: Recovery code verlossing mislukt.
ru: Ошибка восстановления кода.
tr: Kurtarma kodu kullanılamadı.

source: Role name '{0}' is already taken.
cs: Jméno Role '{0}' je již obsazen.
fa: نام نقش '{0}' قبلا گرفته شده است.
nl: Rol naam '{0}' is al in gebruik.
ru: Имя роли '{0}' уже занято.
tr: Rol adı '{0}' önceden kayıtlıdır.

source: Role name '{0}' is invalid.
cs: Jméno Role '{0}' je neplatná.
fa: نام نقش '{0}' نامعتبر است.
nl: Rol naam '{0}' is ongeldig.
ru: Имя роли '{0}' является недействительным.
tr: Rol adı '{0}' geçerli değildir.

source: The argument '{0}' cannot be null, empty or contain only whitespace.
cs: Tento argument ‚{0}‘ nemůže být nulový, prázdný, nebo obsahují pouze mezery.
fa: آرگومان {0} 'نمی تواند تهی، خالی است و یا فقط شامل فضای خالی.
nl: Het argument '{0}' kan niet null, leeg zijn of bevatten alleen witruimte.
ru: Аргумент '{0}' не может быть нулевым, пустым или содержать только пробел.
tr: '{0}' argümanı boş olamaz, boş olamaz veya sadece boşluk içerebilir.

source: The associated metadata type for type '{0}' contains the following unknown properties or fields: {1}. Please make sure that the names of these members match the names of the properties on the main type.
cs: Přidružený typ metadata pro typ {0} 'obsahuje následující vlastnosti nejsou známé nebo pole: {1}. Ujistěte se, že jména těchto členů odpovídají jménům vlastností na hlavním typu.
fa: نوع فراداده همراه برای نوع '{0}' شامل موارد زیر است خواص ناشناخته و یا زمینه های: {1}. لطفا مطمئن شوید که نام این اعضای مطابقت با نام از خواص به نوع اصلی.
nl: De bijbehorende metadata soort van type '{0}' bevat de volgende onbekende eigenschappen of velden: {1}. Zorg ervoor dat de namen van deze leden overeenkomen met de namen van de eigenschappen van de belangrijkste type.
ru: Связанный тип метаданных для типа '{0}' содержит следующие неизвестные свойства или поля: {1}. Пожалуйста, убедитесь, что имена этих членов совпадают с именами свойств основного типа.
tr: '{0}' tipi için ilişkili meta veri türü, aşağıdaki bilinmeyen özellikleri veya alanları içerir: {1}. Lütfen bu üyelerin adlarının ana türdeki özelliklerin adlarıyla eşleştiğinden emin olun.

source: The custom DataType string cannot be null or empty.
cs: Vlastní DataType řetězec nemůže být null nebo prázdný.
fa: رشته نوع داده های سفارشی نمی تواند تهی و یا خالی است.
nl: De aangepaste Gegevenstype string kan niet null of leeg zijn.
ru: Пользовательская строка DataType не может быть нулевой или пустой.
tr: Özel DataType dizesi boş veya hiç olamaz.

source: The custom validation type '{0}' must be public.
cs: Vlastní typ validace ‚{0}‘ musí být veřejné.
fa: نوع اعتبار سفارشی '{0}' باید عمومی باشد.
nl: Het type aangepaste validatie '{0}' moet openbaar zijn.
ru: Пользовательский тип проверки '{0}' должен быть публичным.
tr: Özel doğrulama türü '{0}' genel olmalı.

source: The CustomValidationAttribute method '{0}' does not exist in type '{1}' or is not public and static.
cs: Způsob CustomValidationAttribute ‚{0}‘ neexistuje v typu '{1} nebo je neveřejný a statické.
fa: روش CustomValidationAttribute '{0} »در نوع وجود ندارد.' {1} 'یا عمومی و ایستا نیست.
nl: De CustomValidationAttribute methode '{0}' bestaat niet in het type '{1}' is of niet openbaar en statisch.
ru: Метод CustomValidationAttribute '{0}' не существует в типе '{1}' или не является общедоступным и статическим.
tr: '{0}' CustomValidationAttribute yöntemi, '{1}' türünde mevcut değil veya genel ve statik değil.

source: The CustomValidationAttribute method '{0}' in type '{1}' must match the expected signature: public static ValidationResult {0}(object value, ValidationContext context). The value can be strongly typed. The ValidationContext parameter is optional.
cs: Způsob CustomValidationAttribute '{0}' v typu '{1}' musí odpovídat očekávanému podpisu: public static ValidationResult {0} (hodnota objektu, ValidationContext kontextu). Tato hodnota může být silně zadali. Parametr ValidationContext je volitelný.
fa: عمومی استاتیک ValidationResult {0} (ارزش شی، ValidationContext زمینه): روش CustomValidationAttribute '{0} در نوع' {1} 'باید امضای مورد انتظار مطابقت. ارزش می توان به شدت تایپ. پارامتر ValidationContext اختیاری است.
nl: public static ValidationResult {0} (object waarde, ValidationContext context): De CustomValidationAttribute methode '{0}' in het type '{1}' moeten de verwachte handtekening te passen. De waarde kan sterk worden getypt. De parameter ValidationContext is optioneel.
ru: Метод CustomValidationAttribute '{0}' в типе '{1}' должен соответствовать ожидаемой подписи: public static ValidationResult {0} (object value, ValidationContext context). Значение может быть типизировано. Параметр ValidationContext является необязательным.
tr: '{1}' türündeki '{0}' CustomValidationAttribute yöntemi beklenen imzayla eşleşmelidir: public static ValidationResult {0} (nesne değeri, ValidationContext bağlamı). Değer kesinlikle yazılabilir. ValidationContext parametresi isteğe bağlıdır.

source: The CustomValidationAttribute method '{0}' in type '{1}' must return System.ComponentModel.DataAnnotations.ValidationResult. Use System.ComponentModel.DataAnnotations.ValidationResult.Success to represent success.
cs: Způsob CustomValidationAttribute '{0}' v typu '{1}' se musí vrátit System.ComponentModel.DataAnnotations.ValidationResult. Použijte System.ComponentModel.DataAnnotations.ValidationResult.Success reprezentovat úspěch.
fa: روش CustomValidationAttribute '{0} در نوع' {1} 'باید System.ComponentModel.DataAnnotations.ValidationResult بازگشت. استفاده از System.ComponentModel.DataAnnotations.ValidationResult.Success برای نشان موفقیت است.
nl: De werkwijze CustomValidationAttribute '{0}' in type '{1}' moet System.ComponentModel.DataAnnotations.ValidationResult terugkeren. Gebruik System.ComponentModel.DataAnnotations.ValidationResult.Success tot succes te vertegenwoordigen.
ru: Метод CustomValidationAttribute «{0}» типа «{1}» должен возвращать System.ComponentModel.DataAnnotations.ValidationResult. Используйте System.ComponentModel.DataAnnotations.ValidationResult.Success при успехе.
tr: '{1}' türündeki CustomValidationAttribute yöntemi '{0}', System.ComponentModel.DataAnnotations.ValidationResult öğesini döndürmelidir. Başarıyı temsil etmek için System.ComponentModel.DataAnnotations.ValidationResult.Success kullanın.

source: The CustomValidationAttribute.Method was not specified.
cs: CustomValidationAttribute.Method nebyl specifikován.
fa: CustomValidationAttribute.Method تعیین نشد.
nl: De CustomValidationAttribute.Method is niet opgegeven.
ru: CustomValidationAttribute.Method не был указан.
tr: CustomValidationAttribute.Method belirtilmedi.

source: The CustomValidationAttribute.ValidatorType was not specified.
cs: CustomValidationAttribute.ValidatorType nebyl specifikován.
fa: CustomValidationAttribute.ValidatorType تعیین نشد.
nl: De CustomValidationAttribute.ValidatorType is niet opgegeven.
ru: CustomValidationAttribute.ValidatorType не был указан.
tr: CustomValidationAttribute.ValidatorType belirtilmedi.

source: The field must be a number.
cs: Pole musí být číslo.
fa: زمینه باید یک عدد باشد.
nl: Het veld moet een getal zijn.
ru: Поле должно быть числом.
tr: Alan rakam olmalı

source: The field of type {0} must be a string, array or ICollection type.
cs: Pole typu {0} musí být řetězec, pole nebo typ ICollection.
fa: زمینه نوع {0} باید یک رشته، آرایه یا نوع ICollection باشد.
nl: Het veld van het type {0} moet een string, array Soort ICollection zijn.
ru: Поле типа {0} должно быть строкой, массивом или типом ICollection.
tr: {0} tipindeki alan bir string, array veya ICollection tipinde olmalıdır.

source: The field {0} is invalid.
cs: Pole {0} je neplatná.
fa: زمینه {0} نامعتبر است.
nl: Het veld {0} is ongeldig.
ru: Поле '{0}' является недопустимым.
tr: {0} alanı geçersiz.

source: The field {0} must be a number.
cs: Pole {0} musí být číslo.
fa: زمینه {0} باید یک عدد باشد.
nl: Het veld {0} moet een getal zijn.
ru: Поле '{0}' должно быть числом.
tr: '{0}' alanı rakam olmalı

source: The field {0} must be a string or array type with a maximum length of '{1}'.
cs: Pole {0} musí být řetězec nebo pole typu s maximální délkou ‚{1}‘.
fa: زمینه {0} باید یک رشته یا آرایه نوع با طول حداکثر شود: '{1}'.
nl: Het veld {0} moet een string of arraytype met een maximumlengte van zijn {1} '.
ru: Поле '{0}' должно иметь тип строки или массива с максимальной длиной '{1}'.
tr: {0} alanı, maksimum uzunluğu '{1}' olan bir dize veya dizi türü olmalıdır.

source: The field {0} must be a string or array type with a minimum length of '{1}'.
cs: Pole {0} musí být řetězec nebo pole typu s minimální délkou ‚{1}‘.
fa: زمینه {0} باید یک رشته یا آرایه نوع با حداقل طول باشد: '{1}'.
nl: Het veld {0} moet een string of matrix type en een lengte van zijn {1} '.
ru: Поле '{0}' должно быть типом строки или массива с минимальной длиной {1}.
tr: {0} alanı, minimum uzunluğu '{1}' olan bir dize veya dizi türü olmalıdır.

source: The field {0} must be a string with a maximum length of {1}.
cs: Pole {0} musí být řetězec s maximální délkou {1}.
fa: زمینه {0} باید یک رشته با طول حداکثر شود {1}.
nl: Het veld {0} moet een tekenreeks met een maximale lengte van {1}.
ru: Поле '{0}' должно быть строкой с максимальной длиной {1}.
tr: {0} alanı, maksimum uzunluğu {1} olan bir dize olmalıdır.

source: The field {0} must be a string with a minimum length of {2} and a maximum length of {1}.
cs: Pole {0} musí být řetězec s minimální délkou {2} a o maximální délce {1}.
fa: زمینه {0} باید یک رشته با طول حداقل از {2} و یک حداکثر طول {1}.
nl: Het veld {0} moet een tekenreeks met een minimale periode van {2} en een maximumlengte van {1}.
ru: Поле '{0}' должно быть строкой с длиной от {2} по {1}.
tr: {0} alanı, minimum uzunluğu {2} ve maksimum uzunluğu {1} olan bir dize olmalıdır.

source: The field {0} must be between {1} and {2}.
cs: Pole {0} musí být mezi {1} a {2}.
fa: زمینه {0} باید بین {1} و {2}.
nl: Het veld {0} moet tussen {1} en {2}.
ru: Поле '{0}' должно быть между {1} ​​и {2}.
tr: {0} alanı {1} ve {2} arasında olmalıdır.

source: The field {0} must match the regular expression '{1}'.
cs: Pole {0} musí odpovídat regulární výraz ‚{1}‘.
fa: زمینه {0} باید عبارت منظم مطابقت '{1}'.
nl: Het veld {0} moet overeenkomen met de reguliere uitdrukking '{1}'.
ru: Поле '{0}' должно соответствовать регулярному выражению '{1}'.
tr: {0} alanı, '{1}' normal ifadesiyle eşleşmelidir.

source: The instance provided must match the ObjectInstance on the ValidationContext supplied.
cs: Instance za předpokladu, se musí shodovat s ObjectInstance na ValidationContext dodané.
fa: به عنوان مثال ارائه باید ObjectInstance در ValidationContext عرضه مطابقت.
nl: De bijvoorbeeld voorzien moet ObjectInstance op de bijgeleverde ValidationContext passen.
ru: Предоставленный экземпляр должен соответствовать ObjectInstance в предоставленном ValidationContext.
tr: Sağlanan örnek, sağlanan ValidationContext'teki ObjectInstance ile eşleşmelidir.

source: The key parameter at position {0} is null. Every key control parameter must be a string.
cs: Klíčovým parametrem v poloze {0} je nulový. Každý parametr ovládací tlačítko musí být řetězec.
fa: پارامتر کلیدی در موقعیت {0} تهی است. هر پارامتر کنترل کلید باید یک رشته باشد.
nl: De belangrijkste parameter op positie {0} is ongeldig. Iedere key control parameter moet een tekenreeks zijn.
ru: Ключевой параметр в позиции {0} является нулевым. Каждый ключевой параметр управления должен быть строкой.
tr: {0} konumundaki anahtar parametresi boş. Her anahtar kontrol parametresi bir dize olmalıdır.

source: The key parameter at position {0} with value '{1}' is not a string. Every key control parameter must be a string.
cs: Klíčovým parametrem v poloze {0} s hodnotou ‚{1}‘ není řetězec. Každý parametr ovládací tlačítko musí být řetězec.
fa: پارامتر کلیدی در موقعیت {0} با ارزش: '{1}' یک رشته نیست. هر پارامتر کنترل کلید باید یک رشته باشد.
nl: De sleutelparameter op positie {0} met waarde {1} 'is geen tekenreeks. Iedere key control parameter moet een tekenreeks zijn.
ru: Ключевой параметр в позиции {0} со значением '{1}' не является строкой. Каждый ключевой параметр управления должен быть строкой.
tr: '{1}' değerine sahip {0} konumundaki anahtar parametresi bir dize değil. Her anahtar kontrol parametresi bir dize olmalıdır.
