Repository: LazZiya/ExpressLocalizationSampleCore3
Catalog: ExpressLocalizationSampleCore3Mvc/LocalizationResources/ExpressLocalizationResource.*.resx
Languages: cs, fa, nl, ru, tr

source: The key parameter at position {0} with value '{1}' occurs more than once.
cs: Klíčovým parametrem v poloze {0} s hodnotou ‚{1}‘ se vyskytuje více než jednou.
fa: پارامتر کلیدی در موقعیت {0} با ارزش '{1}' رخ می دهد بیش از یک بار.
nl: De sleutelparameter op positie {0} met waarde {1} 'meerdere malen voorkomt.
ru: Ключевой параметр в позиции {0} со значением '{1}' встречается более одного раза.
tr: '{1}' değerine sahip {0} konumundaki anahtar parametresi birden fazla gerçekleşiyor.

source: The maximum length must be a nonnegative integer.
cs: Maximální délka musí být kladné celé číslo.
fa: طول حداکثر باید یک عدد صحیح نامنفی باشد.
nl: De maximumlengte moet een niet-negatief getal zijn.
ru: Максимальная длина должна быть неотрицательным целым числом.
tr: Maksimum uzunluk negatif olmayan bir tamsayı olmalıdır.

source: The maximum value '{0}' must be greater than or equal to the minimum value '{1}'.
cs: Maximální hodnota '{0} musí být větší než nebo rovna minimální hodnotě ‚{1}‘.
fa: حداکثر مقدار '{0}' باید بزرگتر یا مساوی به ارزش حداقل باشد: '{1}'.
nl: De maximumwaarde '{0}' groter dan of gelijk aan de minimale waarde '{1}'.
ru: Максимальное значение {0} должно быть больше или равно минимальному значению {1}.
tr: '{0}' maksimum değeri, '{1}' minimum değerine eşit veya daha büyük olmalıdır.

source: The minimum and maximum values must be set.
cs: Hodnoty minimální a maximální musí být nastaven.
fa: حداقل و حداکثر مقادیر باید تنظیم شود.
nl: De minimale en maximale waarden moeten worden ingesteld.
ru: Минимальное и максимальное значения должны быть установлены.
tr: Minimum ve maksimum değerler ayarlanmalıdır.

source: The number of control parameters must be even.
cs: Počet kontrolních parametrů musí být sudý.
fa: تعداد پارامترهای کنترل، زوج است.
nl: Het aantal controle parameters moet even zijn.
ru: Количество контрольных параметров должно быть четным.
tr: Kontrol parametrelerinin sayısı eşit olmalıdır.

source: The OperandType must be set when strings are used for minimum and maximum values.
cs: OperandType musí být nastaven, když struny jsou určeny pro minimální a maximální hodnoty.
fa: OperandType زمانی باید تنظیم شود رشته ها برای مقادیر حداقل و حداکثر استفاده می شود.
nl: De OperandType moet worden ingesteld als strings worden gebruikt voor de minimale en maximale waarden.
ru: OperandType должен быть установлен, когда строки используются для минимальных и максимальных значений.
tr: OperandType, dizgiler minimum ve maksimum değerler için kullanıldığında ayarlanmalıdır.

source: The pattern must be set to a valid regular expression.
cs: Vzor musí být nastaven na platný regulární výraz.
fa: الگوی باید به یک عبارت معتبر به طور منظم تنظیم.
nl: Het patroon moet worden ingesteld op een geldige reguliere expressie.
ru: Шаблон должен быть установлен в правильное регулярное выражение.
tr: Desen geçerli bir normal ifadeye ayarlanmalıdır.

source: The property '{0}' on resource type '{1}' is not a string type.
cs: Vlastnost ‚{0}‘ na typ prostředku ‚{1}‘ není typu string.
fa: از مشخصه "{0} 'در نوع منبع:' {1} 'یک نوع رشته است.
nl: De eigenschap '{0}' van het type resource '{1}' is niet een string type.
ru: Свойство '{0}' для типа ресурса '{1}' не является строковым типом.
tr: '{1}' kaynak türündeki '{0}' özelliği bir dize türü değil.

source: The property {0}.{1} could not be found.
cs: Vlastnost {0}. {1} nelze nalézt.
fa: اموال {0}. {1} پیدا نشد.
nl: De eigenschap {0}. {1} kan niet worden gevonden.
ru: Свойство {0}.{1} не может быть найдено.
tr: {0}. {1} özelliği bulunamadı.

source: The resource type '{0}' does not have an accessible static property named '{1}'.
cs: Typ prostředku ‚{0}‘ není přístupný statickou vlastnost s názvem ‚{1}‘.
fa: نوع منبع '{0}' می کند اموال قابل دسترس شخص به نام ندارد '{1}'.
nl: Het type resource '{0}' heeft geen toegankelijke statische eigenschap met de naam '{1}'.
ru: Тип ресурса '{0}' не имеет доступного статического свойства с именем '{1}'.
tr: '{0}' kaynak türü '{1}' adlı erişilebilir bir statik özelliğe sahip değil.

source: The supplied value is invalid for {0}.
cs: Zadaná hodnota je neplatná pro {0}.
fa: ارزش عرضه نامعتبر برای {0} است.
nl: De geleverde waarde is ongeldig voor {0}.
ru: Предоставленное значение недопустимо для {0}.
tr: '{0}' alan değeri geçerli değil

source: The supplied value is invalid.
cs: Zadaná hodnota je neplatná.
fa: ارزش معتبر نیست.
nl: De geleverde waarde is ongeldig.
ru: Предоставленное значение недействительно.
tr: Verilen değer geçerli değil

source: The type '{0}' does not contain a public property named '{1}'.
cs: Typ ‚{0}‘ neobsahuje veřejnou vlastnost s názvem ‚{1}‘.
fa: نوع '{0}' شامل یک ویژگی عمومی به نام نمی '{1}'.
nl: Het type '{0}' bestaat geen openbare eigenschap met de naam bevatten {1} '.
ru: Тип '{0}' не содержит публичного свойства с именем '{1}'.
tr: '{0}' tipi '{1}' adlı bir ortak özellik içermiyor.

source: The type '{0}' needs to represent an enumeration type.
cs: Typ ‚{0}‘ musí představovat typ výčtu.
fa: نوع '{0}' نیاز به نشان دهنده یک نوع شمارش.
nl: Het type '{0}' moet een opsommingstype vertegenwoordigen.
ru: Тип '{0}' должен представлять собой тип перечисления.
tr: '{0}' tipinin bir numaralandırma (enum) tipini temsil etmesi gerekir.

source: The type provided for EnumDataTypeAttribute cannot be null.
cs: Jak je stanoven EnumDataTypeAttribute nemůže být nulový.
fa: نوع ارائه شده برای EnumDataTypeAttribute نمی تواند تهی.
nl: De soort zijn EnumDataTypeAttribute kan niet leeg zijn.
ru: Тип, предоставленный для EnumDataTypeAttribute, не может быть нулевым.
tr: EnumDataTypeAttribute için sağlanan tür boş olamaz.

source: The type {0} must implement {1}.
cs: Typ {0} musí implementovat {1}.
fa: نوع {0} را باید اجرا {1}.
nl: Het type {0} moet implementeren {1}.
ru: Тип '{0}' должен реализовывать '{1}'.
tr: {0} tipi {1} uygulamalıdır.

source: The value '{0}' is invalid.
cs: Hodnota ‚{0}‘ je neplatná.
fa: ارزش '{0}' نامعتبر است.
nl: De waarde '{0}' is ongeldig.
ru: Значение '{0}' недопустимо.
tr: '{0}' değeri geçerli değil

source: The value '{0}' is not valid for {1}.
cs: Hodnota '{0}' není platný pro {1}.
fa: ارزش '{0}' برای معتبر نیست {1}.
nl: De waarde '{0}' is niet geldig voor {1}.
ru: Значение '{0}' недопустимо для {1}.
tr: '{0}' değeri '{1}' alanı için geçerli değil

source: The value '{0}' is not valid.
cs: Hodnota ‚{0}‘ není platný.
fa: ارزش '{0}' معتبر نیست.
nl: De waarde '{0}' is niet geldig.
ru: Значение '{0}' недопустимо.
tr: '{0}' değeri geçerli değil

source: The value for property '{0}' must be of type '{1}'.
cs: Hodnota pro vlastnost ‚{0}‘ musí být typu ‚{1}‘.
fa: ارزش برای املاک '{0} "باید از این نوع باشد:' {1} '.
nl: De waarde voor de eigenschap '{0}' moeten van type '{1}'.
ru: Значение свойства '{0}' должно иметь тип '{1}'.
tr: '{0}' özelliğinin değeri '{1}' türünde olmalıdır.

source: The {0} field is not a valid credit card number.
cs: {0} pole není platné číslo kreditní karty.
fa: {0} درست است شماره کارت اعتباری معتبر نیست.
nl: Het veld {0} is geen geldig creditcardnummer.
ru: Поле '{0}' не является допустимым номером кредитной карты.
tr: {0} alanı geçerli bir kredi kartı numarası değil.

source: The {0} field is not a valid e-mail address.
cs: {0} pole není platná e-mailová adresa.
fa: {0} درست است آدرس ایمیل معتبر نیست.
nl: Het veld {0} is geen geldig e-mail adres.
ru: Поле '{0}' не является действительным адресом электронной почты.
tr: {0} alanı geçerli bir e-posta adresi değil.

source: The {0} field is not a valid fully-qualified http, https, or ftp URL.
cs: {0} pole není platný plně kvalifikovaný http, https nebo ftp URL.
fa: {0} درست است معتبر طور کامل واجد شرایط نیست HTTP، HTTPS، FTP و یا URL.
nl: Het veld {0} is geen geldig volledig gekwalificeerde http, https of ftp URL.
ru: Поле '{0}' не является действительным полностью квалифицированным HTTP, HTTPS, FTP или URL.
tr: {0} alanı geçerli bir tam nitelikli http, https veya ftp URL'si değil.

source: The {0} field is not a valid phone number.
cs: {0} pole není platné telefonní číslo.
fa: {0} درست است یک شماره تلفن معتبر نیست.
nl: Het veld {0} is geen geldig telefoonnummer.
ru: Поле '{0}' не является допустимым номером телефона.
tr: {0} alanı geçerli bir telefon numarası değil.

source: The {0} field is required.
cs: Požaduje se, aby {0} pole.
fa: زمینه {0} مورد نیاز است.
nl: De {0} veld is vereist.
ru: Поле '{0}' обязательно для заполнения.
tr: {0} alanı zorunludur.

source: The {0} field only accepts files with the following extensions: {1}
cs: {0} pole lze pouze soubory s následujícími příponami: {1}
fa: {0} درست تنها فایل های پذیرد با پسوندهای زیر: {1}
nl: Het veld {0} accepteert alleen bestanden met de volgende extensies: {1}
ru: Поле '{0}' принимает только файлы со следующими расширениями: {1}
tr: {0} alanı yalnızca aşağıdaki uzantılara sahip dosyaları kabul eder: {1}

source: The {0} property has not been set. Use the {1} method to get the value.
cs: {0} vlastnost nebyla nastavena. Pomocí {1} způsob k získání hodnoty.
fa: {0} اموال تعیین نشده است. با استفاده از روش {1} برای بدست آوردن مقدار.
nl: De {0} eigenschap is niet ingesteld. Gebruik de {1} methode om de waarde te krijgen.
ru: Свойство '{0}' не было установлено. Используйте метод '{1}', чтобы получить значение.
tr: {0} özelliği ayarlanmadı. Değeri elde etmek için {1} yöntemini kullanın.

source: User already has a password set.
cs: Uživatel má již nastaveno heslo.
fa: کاربر در حال حاضر مجموعه ای از رمز عبور.
nl: Gebruiker heeft al een wachtwoord ingesteld.
ru: У пользователя уже установлен пароль.
tr: Kullanıcının bir şifresi zaten vardır.

source: User already in role '{0}'.
cs: Uživatel již v roli ‚{0}‘.
fa: کاربر در حال حاضر در نقش '{0}.
nl: Gebruiker al in de rol van '{0}'.
ru: Пользователь уже имеет роль '{0}'.
tr: Kullanıcının zaten '{0}' rolü vardır.

source: User is not in role '{0}'.
cs: Uživatel není v roli ‚{0}‘.
fa: کاربر در نقش نمی '{0}.
nl: Gebruiker is niet in de rol van '{0}'.
ru: У пользователя нет роли '{0}'.
tr: Kullanıcının '{0}' rolü yoktur.

source: User name '{0}' is already taken.
cs: Uživatelské jméno ‚{0}‘ je již obsazen.
fa: نام کاربری: '{0} قبلا گرفته شده است.
nl: User name '{0}' is al in gebruik.
ru: Имя пользователя '{0}' уже занято.
tr: Kullanıcı adı '{0}' önceden kayıtlıdır

source: User name '{0}' is invalid, can only contain letters or digits.
cs: Uživatelské jméno ‚{0}‘ je neplatná, může obsahovat pouze písmena nebo číslice.
fa: نام کاربری '{0}' نامعتبر است، تنها می تواند شامل حروف و یا اعداد نیست.
nl: User name '{0}' is ongeldig, kan alleen letters of cijfers.
ru: Имя пользователя '{0}' недопустимо, может содержать только буквы или цифры.
tr: Kullanıcı adı '{0}' geçerli değildir.

source: {0} is not valid.
cs: {0} není platný.
fa: {0} معتبر نیست.
nl: {0} is niet geldig.
ru: {0} не является действительным.
tr: {0} geçerli değil.

source: '{0}' and '{1}' do not match.
cs: '{0}‘a '{1}' se neshodují.
fa: '{0} 'و' {1} 'مطابقت ندارند.
nl: '{0}' en '{1}' niet overeenkomen.
ru: '{0}' и '{1}' не совпадают.
tr: '{0}' ve '{1}' eşleşmiyor.

source: Current password
cs: Aktuální heslo!
fa: رمز عبور فعلی!
nl: Huidig wachtwoord!
tr: Eski şifre

source: New password
cs: Nové heslo!
fa: رمز عبور جدید
nl: Nieuw wachtwoord!
tr: Yeni şifre

source: Phone number
cs: Ještě telefon.
fa: شماره تلفن
nl: Telefoonnummer!
tr: Telefon numarası

source: User name
cs: & Přejmenovat
fa: نام‌کاربری
nl: Gebruikersnaam
tr: Kullanıcı adı

source: Verification code
cs: Potvrzovací kód!
fa: کد تأیید
nl: Bevestigingscode!
tr: Doğrulama kodu

source: Remember me
cs: Vzpomeň si na mě!
fa: منو بخاطر بيار.
nl: Onthoud mij!
tr: Beni hatırla

source: Remember this machine?
cs: Vzpomínáte si na toto zařízení?
fa: آیا این دستگاه را به یاد می آورید؟!
nl: Herinner je je dit apparaat?
tr: Bu cihazı hatırla?

source: Confirm new password
cs: Potvrďte své nové heslo!
fa: رمز عبور جدید خود را تایید کنید
nl: Bevestig uw nieuwe wachtwoord!
