Repository: LazZiya/ExpressLocalizationSampleCore3
Catalog: ExpressLocalizationSampleCore3/LocalizationResources/ExpressLocalizationResource.*.resx
Languages: ar, de, fr, hi, hu, it, ja, ko, pt_br

source: The CustomValidationAttribute method '{0}' in type '{1}' must match the expected signature: public static ValidationResult {0}(object value, ValidationContext context). The value can be strongly typed. The ValidationContext parameter is optional.
ar: يجب أن تطابق طريقة CustomValidationAttribute '{0}' في النوع '{1}' التوقيع المتوقع: ثابت ثابت ValidationResult {0} (قيمة الكائن ، سياق ValidationContext). يمكن كتابة القيمة بشدة. المعلمة ValidationContext اختيارية.
de: Die CustomValidationAttribute-Methode '{0}' im Typ '{1}' muss mit der erwarteten Signatur übereinstimmen: public static ValidationResult {0} (Objektwert, ValidationContext-Kontext). Der Wert kann stark eingegeben werden. Der Parameter ValidationContext ist optional.
fr: La méthode CustomValidationAttribute '{0}' dans le type '{1}' doit correspondre à la signature attendue: public static ValidationResult {0} (valeur de l'objet, le contexte ValidationContext). La valeur peut être fortement typé. Le paramètre ValidationContext est facultatif.
hi: सार्वजनिक स्थिर ValidationResult {0} (वस्तु मूल्य, ValidationContext संदर्भ): CustomValidationAttribute विधि '{0}' प्रकार में '{1}' अपेक्षित हस्ताक्षर से मेल करना होगा। मूल्य दृढ़ता से टाइप किया जा सकता है। ValidationContext पैरामीटर वैकल्पिक है।
hu: A CustomValidationAttribute módszer '{0}' típusú '{1}' meg kell egyeznie a várt aláírással: public static ValidationResult {0} (objektum értéke, ValidationContext összefüggésben). Az érték lehet erősen típusos. A ValidationContext paraméter megadása nem kötelező.
it: Il metodo CustomValidationAttribute '{0}' nel tipo '{1}' deve corrispondere alla firma prevista: static ValidationResult pubblico {0} (valore oggetto, contesto ValidationContext). Il valore può essere fortemente tipizzato. Il parametro ValidationContext è facoltativo.
ja: パブリック静的ValidationResult {0}（オブジェクト値、ValidationContextコンテキスト）：タイプCustomValidationAttributeメソッド '{0}' '{1}' が期待シグネチャと一致しなければなりません。値は、強く型付けすることができます。 ValidationContextパラメータはオプションです。
ko: 정적 공용에 ValidationResult {0} (개체 값 ValidationContext 컨텍스트) 다음 CustomValidationAttribute 방법은 '{0}'타입 '{1} 예상 된 서명과 일치한다. 값은 강력하게 입력 할 수 있습니다. ValidationContext 매개 변수는 선택 사항입니다.
pt_br: O método CustomValidationAttribute '{0}' no tipo '{1}' deve corresponder à assinatura esperada: public static ValidationResult {0}(object value, ValidationContext context). O valor pode ser fortemente tipado. O parâmetro ValidationContext é opcional.

source: The CustomValidationAttribute method '{0}' in type '{1}' must return System.ComponentModel.DataAnnotations.ValidationResult. Use System.ComponentModel.DataAnnotations.ValidationResult.Success to represent success.
ar: يجب أن تقوم طريقة CustomValidationAttribute '{0}' في النوع '{1}' بإرجاع System.ComponentModel.DataAnnotations.ValidationResult. استخدم System.ComponentModel.DataAnnotations.ValidationResult.Success لتمثيل النجاح.
de: Die CustomValidationAttribute-Methode '{0}' in Typ '{1}' muss System.ComponentModel.DataAnnotations.ValidationResult zurückgeben. Verwenden Sie System.ComponentModel.DataAnnotations.ValidationResult.Success, um den Erfolg darzustellen.
fr: La méthode CustomValidationAttribute '{0}' dans le type '{1}' doit retourner System.ComponentModel.DataAnnotations.ValidationResult. Utilisez System.ComponentModel.DataAnnotations.ValidationResult.Success pour représenter le succès.
hi: CustomValidationAttribute विधि '{0}' प्रकार में '{1}' System.ComponentModel.DataAnnotations.ValidationResult लौट जाना चाहिए। System.ComponentModel.DataAnnotations.ValidationResult.Success का प्रयोग सफलता प्रतिनिधित्व करते हैं।
hu: A CustomValidationAttribute módszer '{0}' típusú '{1}' vissza kell térnie System.ComponentModel.DataAnnotations.ValidationResult. Használja System.ComponentModel.DataAnnotations.ValidationResult.Success képviseletére siker.
it: Il metodo CustomValidationAttribute '{0}' nel tipo '{1}' deve tornare System.ComponentModel.DataAnnotations.ValidationResult. Utilizzare System.ComponentModel.DataAnnotations.ValidationResult.Success per rappresentare il successo.
ja: CustomValidationAttributeメソッドタイプ '{0}' '{1}' System.ComponentModel.DataAnnotations.ValidationResultを返さなければなりません。成功を表すためにSystem.ComponentModel.DataAnnotations.ValidationResult.Successを使用してください。
ko: CustomValidationAttribute 방법은 '{0}'형식의 '{1}'System.ComponentModel.DataAnnotations.ValidationResult을 반환해야합니다. 성공을 나타내는 System.ComponentModel.DataAnnotations.ValidationResult.Success를 사용합니다.
pt_br: O método CustomValidationAttribute '{0}' no tipo '{1}' deve retornar System.ComponentModel.DataAnnotations.ValidationResult. Use System.ComponentModel.DataAnnotations.ValidationResult.Success para representar sucesso.

source: The CustomValidationAttribute.Method was not specified.
ar: لم يتم تحديد CustomValidationAttribute.Method.
de: Die CustomValidationAttribute.Method wurde nicht angegeben.
fr: Le CustomValidationAttribute.Method n'a pas été spécifié.
hi: CustomValidationAttribute.Method निर्दिष्ट नहीं थी।
hu: A CustomValidationAttribute.Method nem volt megadva.
it: La CustomValidationAttribute.Method non è stato specificato.
ja: CustomValidationAttribute.Methodが指定されていません。
ko: CustomValidationAttribute.Method이 지정되지 않았습니다.
pt_br: CustomValidationAttribute.Method não foi especificado.

source: The CustomValidationAttribute.ValidatorType was not specified.
ar: لم يتم تحديد CustomValidationAttribute.ValidatorType.
de: Der CustomValidationAttribute.ValidatorType wurde nicht angegeben.
fr: Le CustomValidationAttribute.ValidatorType n'a pas été spécifié.
hi: CustomValidationAttribute.ValidatorType निर्दिष्ट नहीं थी।
hu: A CustomValidationAttribute.ValidatorType nem volt megadva.
it: La CustomValidationAttribute.ValidatorType non è stato specificato.
ja: CustomValidationAttribute.ValidatorTypeが指定されていません。
ko: CustomValidationAttribute.ValidatorType이 지정되지 않았습니다.
pt_br: CustomValidationAttribute.ValidatorType não foi especificado.

source: The field must be a number.
ar: يجب أن يكون الحقل رقمًا.
de: Das Feld muss eine Zahl sein.
fr: Le champ doit être un nombre.
hi: क्षेत्र एक संख्या होनी चाहिए।
hu: A mező számnak kell lennie.
it: Il campo deve essere un numero.
ja: フィールドは数字でなければなりません。
ko: 필드는 숫자 여야합니다.
pt_br: O campo deve ser um número.

source: The field of type {0} must be a string, array or ICollection type.
ar: يجب أن يكون حقل النوع {0} عبارة عن سلسلة أو صف أو نوع ICollection.
de: Das Feld vom Typ {0} muss ein String-, Array- oder ICollection-Typ sein.
fr: Le champ de type {0} doit être une chaîne, un tableau ou un type de ICollection.
hi: प्रकार के क्षेत्र {0} एक स्ट्रिंग, सरणी या ICollection प्रकार होना चाहिए।
hu: A mező a {0} típusú kell, hogy legyen egy string, tömb vagy ICollection típusú.
it: Il campo di tipo {0} deve essere una stringa, matrice o tipo ICollection.
ja: タイプ{0}のフィールドは、文字列、アレイ又はいるICollectionタイプでなければなりません。
ko: 타입 필드는 {0} 문자열 배열 또는 ICollection이 타입이어야한다.
pt_br: O campo do tipo {0} deve ser uma string, array ou tipo ICollection.

source: The field {0} is invalid.
ar: الحقل {0} غير صالح.
de: Das Feld {0} ist ungültig.
fr: Le champ {0} est invalide.
hi: क्षेत्र {0} अमान्य है।
hu: A mező {0} érvénytelen.
it: Il campo {0} non è valido.
ja: フィールド{0}は無効です。
ko: 필드 {0} 유효하지 않습니다.
pt_br: O campo {0} é inválido.

source: The field {0} must be a number.
ar: يجب أن يكون الحقل {0} رقماً.
de: Das Feld {0} muss eine Zahl sein.
fr: Le champ {0} doit être un nombre.
hi: क्षेत्र {0} एक संख्या होनी चाहिए।
hu: A mező {0} számnak kell lennie.
it: Il campo {0} deve essere un numero.
ja: フィールド{0}は数値でなければなりません。
ko: 필드 {0} 숫자 여야합니다.
pt_br: O campo {0} deve ser um número.

source: The field {0} must be a string or array type with a maximum length of '{1}'.
ar: يجب أن يكون الحقل {0} عبارة عن سلسلة أو نوع صفّي بطول أقصى '{1}'.
de: Das Feld {0} muss ein String- oder Array-Typ mit einer maximalen Länge von '{1}' sein.
fr: Le champ {0} doit être un type de chaîne ou un tableau d'une longueur maximale de « {1} ».
hi: क्षेत्र {0} की अधिकतम लंबाई के साथ एक स्ट्रिंग या सरणी प्रकार होना चाहिए '{1}'।
hu: A mező {0} kell lennie egy karakterlánc vagy tömb típusú maximális hossza „{1}”.
it: Il campo {0} deve essere una stringa o un array di tipo con una lunghezza massima di '{1}'.
ja: フィールド{0} {1}の最大長ストリング、または配列型でなければなりません。
ko: 이 필드는 {0}의 최대 길이를 가진 문자열이나 배열 타입이어야한다 '{1}.
pt_br: O campo {0} deve ser uma cadeia de caracteres ou um array com um comprimento máximo de '{1}'.

source: The field {0} must be a string or array type with a minimum length of '{1}'.
ar: يجب أن يكون الحقل {0} عبارة عن سلسلة أو نوع صفّي بطول لا يقل عن '{1}'.
de: Das Feld {0} muss ein String- oder Array-Typ mit einer Mindestlänge von '{1}' sein.
fr: Le champ {0} doit être un type de chaîne ou un tableau avec une longueur minimale de « {1} ».
hi: क्षेत्र {0} की एक न्यूनतम लंबाई के साथ एक स्ट्रिंग या सरणी प्रकार होना चाहिए '{1}'।
hu: A mező {0} kell lennie egy karakterlánc vagy tömb típusú egy minimális hossza „{1}”.
it: Il campo {0} deve essere una stringa o un array di tipo con una lunghezza minima di '{1}'.
ja: フィールド{0} {1}の最小の長さの文字列または配列型でなければなりません。
ko: 이 필드는 {0}의 최소 길이를 가진 문자열이나 배열 타입이어야한다 '{1}.
pt_br: O campo {0} deve ser uma cadeia de caracteres ou um array com um comprimento mínimo de '{1}'.

source: The field {0} must be a string with a maximum length of {1}.
ar: يجب أن يكون الحقل {0} عبارة عن سلسلة بطول أقصى {1}.
de: Das Feld {0} muss eine Zeichenfolge mit einer maximalen Länge von {1} sein.
fr: Le champ {0} doit être une chaîne avec une longueur maximale de {1}.
hi: क्षेत्र {0} की अधिकतम लंबाई के साथ एक स्ट्रिंग होना चाहिए {1}।
hu: A mező {0} kell lennie karakterlánc maximális hossza {1}.
it: Il campo {0} deve essere una stringa di lunghezza massima di {1}.
ja: フィールド{0}、{1}の最大長さの文字列でなければなりません。
ko: {0} 필드는 최대 길이 문자열이어야합니다 {1}.
pt_br: O campo {0} deve ser uma cadeia de caracteres com um comprimento máximo de {1}.

source: The field {0} must be a string with a minimum length of {2} and a maximum length of {1}.
ar: يجب أن يكون الحقل {0} عبارة عن سلسلة بطول الحد الأدنى {2} والحد الأقصى للطول {1}.
de: Das Feld {0} muss eine Zeichenfolge mit einer Mindestlänge von {2} und einer Höchstlänge von {1} sein.
fr: Le champ {0} doit être une chaîne avec une longueur minimale de {2} et une longueur maximale de {1}.
hi: क्षेत्र {0} {2} और की अधिकतम लंबाई की एक न्यूनतम लंबाई के साथ एक स्ट्रिंग होना चाहिए {1}।
hu: A mező {0} kell lennie egy string egy minimális hossza {2} és egy maximális hossza {1}.
it: Il campo {0} deve essere una stringa di lunghezza minima di {2} e una lunghezza massima di {1}.
ja: フィールド{0} {2}の最小長と{1}の最大長さの文字列でなければなりません。
ko: {0} 필드는 {2}의 최대 길이와 최소 길이의 문자열이어야 {1}.
pt_br: O campo {0} deve ser uma cadeia de caracteres com um comprimento mínimo de {2} e um comprimento máximo de {1}.

source: The field {0} must be between {1} and {2}.
ar: يجب أن يكون الحقل {0} بين {1} و {2}.
de: Das Feld {0} muss zwischen {1} und {2} liegen.
fr: Le champ {0} doit être comprise entre {1} et {2}.
hi: क्षेत्र {0} के बीच होना चाहिए {1} और {2}।
hu: A mező {0} között kell lennie {1} és {2}.
it: Il campo {0} deve essere compreso tra {1} e {2}.
ja: フィールド{0}の間でなければなりません{1}と{2}。
ko: 필드 {0} 사이 여야 및 {1} {2}.
pt_br: O campo {0} deve estar entre {1} e {2}.

source: The field {0} must match the regular expression '{1}'.
ar: يجب أن يتطابق الحقل {0} مع التعبير العادي '{1}'.
de: Das Feld {0} muss mit dem regulären Ausdruck '{1}' übereinstimmen.
fr: Le champ {0} doit correspondre à l'expression régulière '{1}'.
hi: क्षेत्र {0} नियमित अभिव्यक्ति से मेल खाना चाहिए '{1}'।
hu: A mező {0} kell egyeznie a reguláris kifejezés „{1}”.
it: Il campo {0} deve corrispondere l'espressione regolare '{1}'.
ja: フィールド{0}は、正規表現と一致しなければなりません「{1}」。
ko: 필드 {0} 정규 표현식과 일치해야합니다 '{1}'.
pt_br: O campo {0} deve corresponder à expressão regular '{1}'.

source: The instance provided must match the ObjectInstance on the ValidationContext supplied.
ar: يجب أن يتطابق المثيل المقدم مع ObjectInstance على ValidationContext الموفر.
de: Die angegebene Instanz muss mit ObjectInstance im angegebenen ValidationContext übereinstimmen.
fr: L'instance prévue doit correspondre au ObjectInstance sur le ValidationContext fourni.
hi: प्रदान की उदाहरण ValidationContext आपूर्ति पर ObjectInstance मेल खाना चाहिए।
hu: Az látva például meg kell egyeznie a ObjectInstance a ValidationContext szállított.
it: L'esempio fornito deve corrispondere al ObjectInstance sul ValidationContext dotazione.
ja: 提供インスタンスが供給ValidationContext上のObjectInstanceと一致する必要があります。
ko: 제공하는 인스턴스가 제공되는 ValidationContext의 ObjectInstance를 일치해야합니다.
pt_br: A instância tem que ser o ObjectInstance na ValidationContext fornecida.

source: The key parameter at position {0} is null. Every key control parameter must be a string.
ar: العامل الرئيسي في الموضع {0} خالٍ. يجب أن يكون كل عامل تحكم رئيسي عبارة عن سلسلة.
de: Der Schlüsselparameter an Position {0} ist null. Jeder Schlüsselsteuerungsparameter muss eine Zeichenfolge sein.
fr: Le paramètre clé à la position {0} est nulle. Chaque paramètre de contrôle clé doit être une chaîne.
hi: स्थिति में प्रमुख पैमाना {0} रिक्त है। हर महत्वपूर्ण नियंत्रण पैरामीटर एक स्ट्रिंग होना चाहिए।
hu: A kulcs paraméter pozícióban {0} null. Minden kulcsfontosságú kontroll paraméter egy karakterláncot.
it: Il parametro chiave nella posizione {0} è nullo. Ogni parametro di controllo chiave deve essere una stringa.
ja: 位置{0}でキーパラメータがnullです。すべてのキー制御パラメータは文字列でなければなりません。
ko: 위치의 키 파라미터는 {0} 널. 모든 키 제어 매개 변수는 문자열이어야합니다.
pt_br: O parâmetro chave na posição {0} é nula. Todos os parâmetros chave de controle devem ser uma cadeia de caracteres.

source: The key parameter at position {0} with value '{1}' is not a string. Every key control parameter must be a string.
ar: العامل المفتاحي في الموضع {0} بالقيمة '{1}' ليس سلسلة. يجب أن يكون كل عامل تحكم رئيسي عبارة عن سلسلة.
de: Der Schlüsselparameter an Position {0} mit dem Wert '{1}' ist keine Zeichenfolge. Jeder Schlüsselsteuerungsparameter muss eine Zeichenfolge sein.
fr: Le paramètre clé à la position {0} avec la valeur « {1} » est pas une chaîne. Chaque paramètre de contrôle clé doit être une chaîne.
hi: स्थिति {0} मान वाली प्रमुख पैमाना '{1}' एक स्ट्रिंग नहीं है। हर महत्वपूर्ण नियंत्रण पैरामीटर एक स्ट्रिंग होना चाहिए।
hu: A kulcs paraméter pozícióban {0} értékű „{1}” nem karakterlánc. Minden kulcsfontosságú kontroll paraméter egy karakterláncot.
it: Il parametro chiave nella posizione {0} con il valore '{1}' non è una stringa. Ogni parametro di controllo chiave deve essere una stringa.
ja: 値の位置{0}で重要なパラメータは、「{1}」の文字列ではありません。すべてのキー制御パラメータは文字列でなければなりません。
ko: 값이 {0} 위치에서 중요한 매개 변수는 '{1} 문자열 아니다. 모든 키 제어 매개 변수는 문자열이어야합니다.
pt_br: O parâmetro chave na posição {0} com o valor '{1}' não é uma cadeia de caracteres. Todos os parâmetros chave de controle devem ser uma cadeia de caracteres.

source: The key parameter at position {0} with value '{1}' occurs more than once.
ar: يتواجد العامل الرئيسي في الموضع {0} بالقيمة '{1}' أكثر من مرة.
de: Der Schlüsselparameter an Position {0} mit dem Wert '{1}' kommt mehrmals vor.
fr: Le paramètre clé à la position {0} avec la valeur « {1} » se produit plus d'une fois.
hi: स्थिति {0} मान वाली प्रमुख पैमाना '{1}' एक से अधिक होता है।
hu: A kulcs paraméter pozícióban {0} értékű „{1}” egynél többször fordul elő.
it: Il parametro chiave nella posizione {0} con il valore '{1}' si verifica più di una volta.
ja: 値の位置{0}で重要なパラメータは、{1}が複数回発生します。
ko: 값이 {0} 위치에서 중요한 매개 변수는 '{1} "번 이상 발생한다.
pt_br: O parâmetro chave na posição {0} com o valor '{1}' ocorre mais de uma vez.

source: The maximum length must be a nonnegative integer.
ar: يجب أن يكون الحد الأقصى للطول عددًا صحيحًا غير سالب.
de: Die maximale Länge muss eine nicht negative Ganzzahl sein.
fr: La longueur maximale doit être un entier non négatif.
hi: अधिकतम लंबाई ग़ैर-ऋणात्मक पूर्णांक होना चाहिए।
hu: A maximális hossz kell nemnegatív egész szám lehet.
it: La lunghezza massima deve essere un numero intero non negativo.
ja: 最大の長さは非負の整数でなければなりません。
ko: 최대 길이는 음수가 아닌 정수 여야합니다.
pt_br: O comprimento máximo deve ser um número inteiro não negativo.

source: The maximum value '{0}' must be greater than or equal to the minimum value '{1}'.
ar: يجب أن تكون القيمة القصوى '{0}' أكبر من أو تساوي الحد الأدنى للقيمة '{1}'.
de: Der Maximalwert '{0}' muss größer oder gleich dem Minimalwert '{1}' sein.
fr: La valeur maximale « {0} » doit être supérieure ou égale à la valeur minimale « {1} ».
hi: अधिकतम मूल्य '{0}' से अधिक या न्यूनतम मूल्य के बराबर होना चाहिए '{1}'।
hu: A maximális érték „{0}” nagyobbnak kell lennie, mint, vagy egyenlő a minimális érték „{1}”.
it: Il valore massimo '{0}' deve essere maggiore o uguale al valore minimo '{1}'.
ja: 最大値は「{0}」「{1}」よりも大きいかまたは最小値に等しくなければなりません。
ko: 최대 값은 '{0} 최소값보다 크거나 같아야'{1}.
pt_br: O valor máximo '{0}' deve ser maior ou igual ao valor mínimo '{1}'.

source: The minimum and maximum values must be set.
ar: يجب تعيين الحد الأدنى والحد الأقصى للقيم.
de: Die Minimal- und Maximalwerte müssen eingestellt werden.
fr: Les valeurs minimales et maximales doivent être fixées.
hi: न्यूनतम और अधिकतम मूल्य निर्धारित किया जाना चाहिए।
hu: A minimális és maximális értékeket kell beállítani.
it: I valori minimi e massimi ammissibili.
ja: 最小値と最大値を設定しなければなりません。
ko: 최소 및 최대 값을 설정해야합니다.
pt_br: Os valores mínimo e máximo devem ser definidos.

source: The number of control parameters must be even.
ar: يجب أن يكون عدد عوامل التحكم متساوٍ.
de: Die Anzahl der Steuerparameter muss gerade sein.
fr: Le nombre de paramètres de contrôle doit être même.
hi: नियंत्रण पैरामीटर की संख्या भी होना चाहिए।
hu: A szabályozási paraméterek számának párosnak kell lennie.
it: Il numero di parametri di controllo deve essere pari.
ja: 制御パラメータの数は偶数でなければなりません。
ko: 제어 매개 변수의 수는도해야합니다.
pt_br: O número de parâmetros de controle devem ser o mesmo.

source: The OperandType must be set when strings are used for minimum and maximum values.
ar: يجب تعيين OperandType عند استخدام السلاسل للقيم الدنيا والقصوى.
de: Der OperandType muss festgelegt werden, wenn Zeichenfolgen für minimale und maximale Werte verwendet werden.
fr: Le OperandType doit être lorsque les chaînes sont utilisées pour les valeurs minimales et maximales.
hi: OperandType जब तार न्यूनतम और अधिकतम मूल्य के लिए उपयोग किया जाता है स्थापित होना चाहिये।
hu: A OperandType kell állítani, ha húrok használják minimum és maximum értékeket.
it: L'OperandType deve essere impostato quando stringhe sono usate per i valori minimi e massimi.
ja: 文字列は最小値と最大値のために使用されている場合OperandTypeを設定する必要があります。
ko: 문자열은 최소 및 최대 값에 사용되는 경우 OperandType 설정되어야한다.
pt_br: O OperandType deve ser definido quando cadeia de caracteres são usadas ​​para valores mínimos e máximos.

source: The pattern must be set to a valid regular expression.
ar: يجب ضبط النمط على تعبير منتظم صالح.
de: Das Muster muss auf einen gültigen regulären Ausdruck gesetzt sein.
fr: Le modèle doit être réglé à une expression régulière valide.
hi: पैटर्न एक मान्य रेगुलर एक्सप्रेशन के लिए सेट किया जाना चाहिए।
hu: A minta kell állítani egy érvényes reguláris kifejezés.
it: Il modello deve essere impostato su un'espressione regolare valida.
ja: パターンは、有効な正規表現に設定する必要があります。
ko: 패턴은 유효한 정규 표현식으로 설정해야합니다.
pt_br: O padrão deve ser definido como uma expressão regular válida.

source: The property '{0}' on resource type '{1}' is not a string type.
ar: الخاصية '{0}' على نوع المورد '{1}' ليست نوع سلسلة.
de: Die Eigenschaft '{0}' für den Ressourcentyp '{1}' ist kein Zeichenfolgentyp.
fr: La propriété '{0}' sur le type de ressource '{1}' est pas un type de chaîne.
hi: संपत्ति '{0}' संसाधन प्रकार पर '{1}' एक स्ट्रिंग प्रकार नहीं है।
hu: A tulajdonság „{0}” erőforrás-típusú „{1}” nem karakterlánc típusú.
it: La proprietà '{0}' sul tipo di risorsa '{1}' non è un tipo stringa.
ja: リソース・タイプのプロパティ「{0}」「{1}」文字列型ではありません。
ko: 자원 유형에 대한 속성 '{0}' '{1}'문자열 유형이 아닙니다.
pt_br: A propriedade '{0}' no tipo de recurso '{1}' não é um tipo string.

source: The property {0}.{1} could not be found.
ar: لم يتم العثور على الخاصية {0}. {1}.
de: Die Eigenschaft {0}. {1} wurde nicht gefunden.
fr: La propriété {0}. {1} n'a pas pu être trouvé.
hi: संपत्ति {0}। {1} नहीं पाया जा सका।
hu: A tulajdonság {0}. {1} nem található.
it: La proprietà {0}. {1} non è stato trovato.
ja: プロパティ{0}。{1}が見つかりませんでした。
ko: 속성 {0}. {1}을 (를) 찾을 수 없습니다.
pt_br: A propriedade {0}.{1} não pôde ser encontrada.

source: The resource type '{0}' does not have an accessible static property named '{1}'.
ar: لا يحتوي نوع المورد '{0}' على خاصية ثابتة يمكن الوصول إليها باسم '{1}'.
de: Der Ressourcentyp "{0}" verfügt nicht über eine zugreifbare statische Eigenschaft mit dem Namen "{1}".
fr: Le type de ressource « {0} » ne dispose pas d'une propriété statique accessible nommé « {1} ».
hi: संसाधन प्रकार '{0}' नामक एक सुलभ स्थिर संपत्ति नहीं है '{1}'।
hu: Az erőforrás típus „{0}” nem rendelkezik egy hozzáférhető statikus tulajdonság elemzi „{1}”.
it: Il tipo di risorsa '{0}' non ha una proprietà statica accessibile denominato '{1}'.
ja: リソースタイプ「{0}」「{1}」という名前のアクセス可能な静的プロパティを持っていません。
ko: 자원 유형 '{0}'라는 이름의 접근 정적 속성이 없습니다 '{1}'.
pt_br: O tipo de recurso '{0}' não tem uma propriedade estática acessível chamada '{1}'.

source: The supplied value is invalid for {0}.
ar: القيمة المتوفرة غير صالحة لـ {0}.
de: Der angegebene Wert ist für {0} ungültig.
fr: La valeur fournie est valide pour {0}.
hi: आपूर्ति मूल्य के लिए {0} अमान्य है।
hu: A mellékelt értéke érvénytelen a {0}.
it: Il valore fornito non è valido per {0}.
ja: 供給された値{0}は無効です。
ko: 제공된 값에 대한 {0} 유효하지 않습니다.
pt_br: O valor fornecido é inválido para {0}.

source: The supplied value is invalid.
ar: القيمة المتوفرة غير صالحة.
de: Der angegebene Wert ist ungültig.
fr: La valeur fournie est invalide.
hi: आपूर्ति की मान अमान्य है।
hu: A mellékelt értéke érvénytelen.
it: Il valore fornito non è valido.
ja: 指定された値が無効です。
ko: 제공된 값이 올바르지 않습니다.
pt_br: O valor fornecido é inválido.

source: The type '{0}' does not contain a public property named '{1}'.
ar: لا يحتوي النوع '{0}' على خاصية عامة تسمى '{1}'.
de: Der Typ "{0}" enthält keine öffentliche Eigenschaft mit dem Namen "{1}".
fr: Le type « {0} » ne contient pas une propriété publique nommée « {1} ».
hi: प्रकार '{0}' एक सार्वजनिक संपत्ति नामित शामिल नहीं है '{1}'।
hu: A típusú „{0}” nem tartalmaz állami tulajdon nevű „{1}”.
it: Il tipo '{0}' non contiene una proprietà pubblica denominata '{1}'.
ja: タイプは、「{0}」「{1}」という名前のパブリックプロパティを含んでいません。
ko: 형식 '{0}'라는 공용 속성을 포함하지 않는 '{1}'.
pt_br: O tipo '{0}' não contém uma propriedade pública denominada '{1}'.

source: The type '{0}' needs to represent an enumeration type.
ar: يحتاج النوع '{0}' إلى تمثيل نوع التعداد.
de: Der Typ '{0}' muss einen Aufzählungstyp darstellen.
fr: Le type « {0} » doit représenter un type d'énumération.
hi: प्रकार '{0}' एक गणना प्रकार का प्रतिनिधित्व करने की जरूरत है।
hu: A típusú „{0}” kell, hogy jelentsen egy felsorolás típusú.
it: Il tipo '{0}' ha bisogno di rappresentare un tipo di enumerazione.
ja: 型「{0}」列挙型を表す必要があります。
ko: 유형은 '{0}'열거 유형을 표시 할 필요가있다.
pt_br: O tipo '{0}' precisa representar um tipo de enumeração.

source: The type provided for EnumDataTypeAttribute cannot be null.
ar: لا يمكن أن يكون النوع المتاح لـ EnumDataTypeAttribute خاليًا.
de: Der für EnumDataTypeAttribute angegebene Typ darf nicht null sein.
fr: Le type prévu EnumDataTypeAttribute ne peut pas être nulle.
hi: प्रकार EnumDataTypeAttribute के लिए प्रदान की खाली नहीं रह सकती।
hu: A típus előírt EnumDataTypeAttribute nem lehet null.
it: Il tipo previsto EnumDataTypeAttribute non può essere nullo.
ja: EnumDataTypeAttributeのために提供タイプはnullにすることはできません。
ko: EnumDataTypeAttribute 제공 유형은 null 일 수 없습니다.
pt_br: O tipo EnumDataTypeAttribute não pode ser nulo.
