Repository: LazZiya/ExpressLocalizationSampleCore3
Catalog: ExpressLocalizationSampleCore3/LocalizationResources/ExpressLocalizationResource.*.resx
Languages: ar, de, fr, hi, hu, it, ja, ko, pt_br

source: '{0}' and '{1}' do not match.
ar: '{0}' و '{1}' غير متطابقين.
de: '{0}' und '{1}' stimmen nicht überein.
fr: '{0} » et '{1}' ne correspondent pas.
hi: '{0}' और '{1} 'मेल नहीं खाते।
hu: '{0}”és '{1}' nem egyeznek.
it: '{0}' e '{1}' non corrispondono.
ja: {0}」と「{1}と一致しません。
ko: '{0}' 및 '{1}' 일치하지 않습니다.
pt_br: '{0}' e '{1}' não coincidem.

source: A non-empty request body is required.
ar: مطلوب نص طلب غير فارغ.
de: Ein nicht leerer Anforderungshauptteil ist erforderlich.
fr: Un corps de demande non vide est nécessaire.
hi: एक गैर खाली अनुरोध शरीर की आवश्यकता है।
hu: A nem üres kérelem szövege van szükség.
it: è necessaria una richiesta corpo non vuoto.
ja: 非空のリクエストボディが必要です。
ko: 비 빈 요청 본문이 필요합니다.
pt_br: Um conteúdo da requisição é obrigatório.

source: A user with this login already exists.
ar: هناك مستخدم لديه معلومات تسجيل الدخول هذه.
de: Ein Benutzer mit diesem Login existiert bereits.
fr: Un utilisateur avec cette connexion existe déjà.
hi: इस लॉगिन वाला उपयोगकर्ता पहले से मौजूद है।
hu: A felhasználó bejelentkezve már létezik.
it: Un utente con questo login esiste già.
ja: このログインを持つユーザーが既に存在しています。
ko: 이 로그인을 가진 사용자가 이미 존재합니다.
pt_br: Já existe um usuário com esse login.

source: A value for the '{0}' parameter or property was not provided.
ar: لم يتم توفير قيمة للعامل أو الخاصية '{0}'.
de: Ein Wert für den Parameter oder die Eigenschaft '{0}' wurde nicht angegeben.
fr: Une valeur pour la « {0} » paramètre ou propriété n'a pas été fourni.
hi: '{0}' पैरामीटर या संपत्ति के लिए एक मूल्य प्रदान नहीं किया गया।
hu: Egy értéket a „{0}” paramétert vagy tulajdonságot nem biztosított.
it: Un valore per il '{0}' parametro o proprietà non è stata fornita.
ja: 「{0}」パラメータまたはプロパティの値が提供されませんでした。
ko: '{0}'파라미터 또는 속성 값이 제공되지 않았다.
pt_br: Um valor para o parâmetro ou propriedade '{0}' não foi fornecido.

source: A value is required.
ar: القيمة مطلوبة.
de: Ein Wert ist erforderlich.
fr: Une valeur est requise.
hi: एक वैल्यू ज़रूरी है।
hu: Egy érték megadása szükséges.
ja: 値が必要とされます。
ko: 값이 필요합니다.
pt_br: Um valor é obrigatório.

source: An unknown failure has occurred.
ar: حدث فشل غير معروف.
de: Ein unbekannter Fehler ist aufgetreten.
fr: Une défaillance inconnue est survenue.
hi: एक अज्ञात विफलता आ गई है।
hu: Egy ismeretlen hiba történt.
it: Un errore sconosciuto si è verificato.
ja: 不明なエラーが発生しました。
ko: 알 수없는 오류가 발생했습니다.
pt_br: Ocorreu uma falha desconhecida.

source: Both ErrorMessageResourceType and ErrorMessageResourceName need to be set on this attribute.
ar: يجب تعيين كل من ErrorMessageResourceType و ErrorMessageResourceName على هذه السمة.
de: Sowohl ErrorMessageResourceType als auch ErrorMessageResourceName müssen für dieses Attribut festgelegt werden.
fr: Les deux ErrorMessageResourceType et ErrorMessageResourceName doivent être définis sur cet attribut.
hi: दोनों ErrorMessageResourceType और ErrorMessageResourceName इस विशेषता पर सेट किया जा करने की जरूरत है।
hu: Mindkét ErrorMessageResourceType és ErrorMessageResourceName kell állítani ezt a tulajdonságot.
it: Sia ErrorMessageResourceType e ErrorMessageResourceName devono essere impostati su questo attributo.
ja: ErrorMessageResourceTypeとErrorMessageResourceNameの両方が、この属性に設定する必要があります。
ko: ErrorMessageResourceType 및 ErrorMessageResourceName 모두이 속성에 설정해야합니다.
pt_br: Ambos ErrorMessageResourceType e ErrorMessageResourceName precisam ser definidos neste atributo.

source: Cannot retrieve property '{0}' because localization failed. Type '{1}' is not public or does not contain a public static string property with the name '{2}'.
ar: لا يمكن استرداد الخاصية '{0}' بسبب فشل الترجمة. النوع '{1}' ليس عامًا أو لا يحتوي على خاصية سلسلة ثابتة عامة بالاسم '{2}'.
de: Die Eigenschaft '{0}' kann nicht abgerufen werden, da die Lokalisierung fehlgeschlagen ist. Typ '{1}' ist nicht öffentlich oder enthält keine öffentliche statische Zeichenfolge mit dem Namen '{2}'.
fr: Impossible de récupérer la propriété « {0} » parce que la localisation a échoué. Tapez « {1} » est pas publique ou ne contient pas une propriété de chaîne statique publique avec le nom « {2} ».
hi: संपत्ति प्राप्त नहीं कर सकता '{0}' क्योंकि स्थानीयकरण विफल रहा है। प्रकार '{1}' सार्वजनिक नहीं है या नाम के साथ एक सार्वजनिक स्थैतिक स्ट्रिंग संपत्ति शामिल नहीं है '{2}'।
hu: Nem lehet letölteni a tulajdon „{0}”, mert lokalizációs sikerült. Type '{1}' nem állami vagy nem tartalmaz public static String tulajdonság neve '{2}'.
it: Impossibile recuperare proprietà '{0}' perché la localizzazione non è riuscita. Tipo '{1}' non è pubblico o non contiene una proprietà pubblica stringa statica con il nome '{2}'.
ja: 局在が失敗したため、「{0}」プロパティを取得できません。型「{1}」パブリックないか、または名前のパブリック静的文字列プロパティが含まれていません '{2}。
ko: 속성을 검색 할 수 없습니다 '{0}'때문에 현지화에 실패했습니다. 형식 '{1}'공공 없거나 이름을 가진 공공 정적 문자열 속성을 포함하지 않는 '{2}'.
pt_br: Não é possível recuperar propriedade '{0}' porque a localização falhou. Tipo '{1}' não é público ou não contém uma propriedade public static string com o nome '{2}'.

source: Could not convert the value of type '{0}' to '{1}' as expected by method {2}.{3}.
ar: لا يمكن تحويل قيمة النوع '{0}' إلى '{1}' كما هو متوقع من الطريقة {2}. {3}.
de: Der Wert vom Typ '{0}' konnte nicht wie von Methode {2} erwartet in '{1}' konvertiert werden. {3}.
fr: Impossible de convertir la valeur de type '{0}' à '{1}' comme prévu par la méthode {2}. {3}.
hi: '{0}' को '{1}' विधि से अपेक्षा के अनुरूप प्रकार का मान नहीं बदला जा सका {2}। {3}।
hu: Nem sikerült átalakítani a típusú érték '{0}' '{1}' a várt módszerrel {2}. {3}.
it: Impossibile convertire il valore di tipo '{0}' a '{1}' come previsto dal metodo {2}. {3}.
ja: メソッド{2}によって予想されるように '{1}' に '{0}' 型の値を変換できませんでした。{3}。
ko: 입력 값을 변환 할 수 없습니다 '{0}'{1}에있어서 예상하기 {2}. {3}.
pt_br: Não foi possível converter o valor do tipo '{0}' para '{1}' como esperado pelo método {2}.{3}.

source: Could not find a property named {0}.
ar: تعذر العثور على خاصية باسم {0}.
de: Es konnte keine Eigenschaft mit dem Namen {0} gefunden werden.
fr: Impossible de trouver une propriété nommée {0}.
hi: एक संपत्ति {0} नामित नहीं मिल सका।
hu: Nem található ingatlan nevű {0}.
it: Impossibile trovare una proprietà denominata {0}.
ja: {0}という名前のプロパティが見つかりませんでした。
ko: 이름 {0} 속성을 찾을 수 없습니다.
pt_br: Não foi possível encontrar uma propriedade denominada {0}.

source: Date
ar: التاريخ
de: Datum
hi: दिनांक
hu: Dátum
it: Data
ja: 日付
ko: 날짜
pt_br: Data

source: Either ErrorMessageString or ErrorMessageResourceName must be set, but not both.
ar: يجب تعيين إما ErrorMessageString أو ErrorMessageResourceName ، ولكن ليس كلاهما.
de: Entweder ErrorMessageString oder ErrorMessageResourceName müssen festgelegt werden, aber nicht beide.
fr: Soit ErrorMessageString ou ErrorMessageResourceName doivent être réglés, mais pas les deux.
hi: या तो ErrorMessageString या ErrorMessageResourceName सेट किया जाना चाहिए, लेकिन दोनों।
hu: Vagy ErrorMessageString vagy ErrorMessageResourceName kell állítani, de nem mindkettő.
it: Sia ErrorMessageString o ErrorMessageResourceName devono essere impostati, ma non entrambi.
ja: ErrorMessageStringまたはErrorMessageResourceNameどちらかは、両方の設定ではなく、しなければなりません。
ko: 어느 ErrorMessageString 또는 ErrorMessageResourceName 모두 설정,하지만해야합니다.
pt_br: Um ErrorMessageString ou ErrorMessageResourceName deve ser definido, mas não ambos.

source: Email '{0}' is already taken.
ar: البريد الإلكتروني '{0}' مسجل مسبقاً.
de: Die E-Mail-Adresse "{0}" ist bereits vergeben.
fr: Email '{0}' est déjà pris.
hi: ई-मेल '{0}' पहले से ही लिया जाता है।
hu: E-mail „{0}” már foglalt.
it: E-mail '{0}' è già utilizzato.
ja: メール「{0}」は既に取られます。
ko: 이메일은 '{0}'이 (가) 이미 취해진 다.
pt_br: Email '{0}' já está em uso.

source: Email '{0}' is invalid.
ar: البريد الإلكتروني '{0}' غير صالح.
de: E-Mail '{0}' ist ungültig.
fr: Email '{0}' est invalide.
hi: ई-मेल '{0}' अमान्य है।
hu: E-mail '{0}' érvénytelen.
it: E-mail '{0}' non è valido.
ja: メールは、 '{0}' は無効です。
ko: 이메일은 '{0}'이 (가) 잘못되었습니다.
pt_br: Email '{0}' é inválido.

source: ID
ar: الهوية
de: ICH WÜRDE
hi: आईडी
ko: 신분증

source: Incorrect password.
ar: رقم السر غير صحيح
de: Falsches Passwort.
fr: Mot de passe incorrect.
hi: गलत पासवर्ड।
hu: Hibás jelszó.
it: Password errata.
ja: 誤ったパスワード。
ko: 잘못된 비밀번호.
pt_br: Senha incorreta.

source: Invalid token.
ar: رمز غير صالح.
de: Ungültiges Token.
fr: Jeton invalide.
hi: अमान्य टोकन।
hu: Érvénytelen kód.
it: Gettone non valido.
ja: 無効なトークン。
ko: 잘못된 토큰.
pt_br: Token inválido.

source: IsValid(object value) has not been implemented by this class. The preferred entry point is GetValidationResult() and classes should override IsValid(object value, ValidationContext context).
ar: لم يتم تطبيق IsValid (قيمة الكائن) بواسطة هذه الفئة. نقطة الإدخال المفضلة هي GetValidationResult () ويجب أن تتجاوز الفئات IsValid (قيمة الكائن ، سياق ValidationContext).
de: IsValid (Objektwert) wurde von dieser Klasse nicht implementiert. Der bevorzugte Einstiegspunkt ist GetValidationResult (), und Klassen sollten IsValid (Objektwert, ValidationContext-Kontext) überschreiben.
fr: IsValid (valeur de l'objet) n'a pas été mis en œuvre par cette classe. Le point d'entrée préféré est GetValidationResult () et les classes doit remplacer IsValid (valeur de l'objet, le contexte ValidationContext).
hi: अगर है (वस्तु मान) इस वर्ग से लागू नहीं किया गया। वरीय प्रवेश बिंदु GetValidationResult () है और कक्षाओं अगर है (वस्तु मूल्य, ValidationContext संदर्भ) ओवरराइड करना चाहिए।
hu: IsValid (objektum értéke) nem valósult meg ebben az osztályban. Az előnyös belépési pontja GetValidationResult () és osztályokat felülírja isValid (objektum értéke, ValidationContext összefüggésben).
it: IsValid (valore oggetto) non è stata attuata da questa classe. Il punto di ingresso preferito è GetValidationResult () e classi dovrebbe sostituire IsValid (valore oggetto, contesto ValidationContext).
ja: IsValidの（オブジェクトの値）は、このクラスによって実装されていません。好適なエントリポイントはGetValidationResult（）とクラスはIsValidの（オブジェクト値、ValidationContextコンテキスト）をオーバーライドする必要があります。
ko: IsValid (개체 값)이 클래스에 의해 구현되지 않았습니다. 바람직한 엔트리 포인트 GetValidationResult ()을하고 IsValid 클래스 (객체 값 ValidationContext 콘텍스트)을 무시한다.
pt_br: IsValid(object value) não foi implementado por esta classe. O ponto de entrada é GetValidationResult() e as classes deve sobrescrever IsValid(object value, ValidationContext context).

source: Lockout is not enabled for this user.
ar: لم يتم تمكين تأمين لهذا المستخدم.
de: Die Sperre ist für diesen Benutzer nicht aktiviert.
fr: Lockout n'est pas activé pour cet utilisateur.
hi: तालाबंदी इस उपयोगकर्ता के लिए सक्षम नहीं है।
hu: Kizárás nem engedélyezett a felhasználó számára.
it: Lockout non è abilitato per questo utente.
ja: ロックアウトは、このユーザーに対して有効になっていません。
ko: 잠금이 사용자를 사용할 수 없습니다.
pt_br: Bloqueio não está habilitado para este usuário.

source: MaxLengthAttribute must have a Length value that is greater than zero. Use MaxLength() without parameters to indicate that the string or array can have the maximum allowable length.
ar: يجب أن يكون MaxLengthAttribute قيمة طول أكبر من الصفر. استخدم MaxLength () بدون عوامل للإشارة إلى أن السلسلة أو الصفيف يمكن أن يكون الحد الأقصى للطول المسموح به.
de: MaxLengthAttribute muss einen Längenwert haben, der größer als Null ist. Verwenden Sie MaxLength () ohne Parameter, um anzugeben, dass die Zeichenfolge oder das Array die maximal zulässige Länge haben kann.
fr: MaxLengthAttribute doit avoir une valeur de longueur supérieure à zéro. Utilisez MaxLength () sans paramètres pour indiquer que la chaîne ou le tableau peuvent avoir la longueur maximale autorisée.
hi: MaxLengthAttribute एक लंबाई मूल्य है कि शून्य से अधिक है होना आवश्यक है। इंगित करने के लिए स्ट्रिंग या सरणी अधिकतम स्वीकार्य लंबाई हो सकता है पैरामीटर के बिना MaxLength () का प्रयोग करें।
hu: MaxLengthAttribute hosszúnak kell lennie értékű, amely nagyobb, mint nulla. Használja MaxLength () paraméterek nélkül, jelezve, hogy a húr vagy tömb lehet a megengedett legnagyobb hosszt.
it: MaxLengthAttribute deve avere un valore di lunghezza che è maggiore di zero. Utilizzare MaxLength () senza parametri per indicare che la stringa o array possono avere la lunghezza massima consentita.
ja: MaxLengthAttributeはゼロより大きい長さの値を持っている必要があります。文字列またはアレイが最大許容長さを有することができることを示すために、パラメータなしのMaxLength（）を使用します。
ko: MaxLengthAttribute는 0보다 큰 길이 값이 있어야합니다. 문자열이나 배열이 최대 허용 길이를 가질 수 있음을 표시하는 매개 변수없이 최대 길이 ()를 사용합니다.
pt_br: MaxLengthAttribute deve ter um valor Length que é maior que zero. Use MaxLength() sem parâmetros para indicar que a cadeia ou matriz pode ter o comprimento máximo permitido.

source: MetadataClassType cannot be null.
ar: لا يمكن لـ MetadataClassType أن تكون خالية.
de: MetadataClassType darf nicht null sein.
fr: MetadataClassType ne peut pas être nulle.
hi: MetadataClassType खाली नहीं रह सकती।
hu: MetadataClassType nem lehet null.
it: MetadataClassType non può essere nullo.
ja: MetadataClassTypeはnullにすることはできません。
ko: MetadataClassType은 null 일 수 없습니다.
pt_br: MetadataClassType não pode ser nulo.

source: MinLengthAttribute must have a Length value that is zero or greater.
ar: يجب أن يكون لـ MinLengthAttribute قيمة طول صفر أو أكبر.
de: MinLengthAttribute muss einen Längenwert haben, der null oder größer ist.
fr: MinLengthAttribute doit avoir une valeur de longueur égale à zéro ou plus.
hi: MinLengthAttribute एक लंबाई मूल्य शून्य या अधिक से अधिक है होना आवश्यक है।
hu: MinLengthAttribute hosszúnak kell lennie érték nulla vagy annál nagyobb.
it: MinLengthAttribute deve avere un valore di lunghezza che è pari a zero o maggiore.
ja: MinLengthAttributeはゼロ以上の長さの値を持っている必要があります。
ko: MinLengthAttribute는 0 개 이상을하는 길이 값이 있어야합니다.
pt_br: MinLengthAttribute deve ter um valor Length que seja zero ou maior.

source: Name
ar: الاسم
fr: prénom
hi: नाम
hu: Név
it: Nome
ja: 名
ko: 이름
pt_br: Nome

source: Optimistic concurrency failure, object has been modified.
ar: فشل التزامن متفائل ، تم تعديل الكائن.
de: Optimistischer Parallelitätsfehler, Objekt wurde geändert.
fr: échec d'accès concurrentiel optimiste, objet a été modifié.
hi: आशावादी संगामिति विफलता, वस्तु संशोधित किया गया है।
hu: Optimista konkurencia hiánya, tárgy módosításra került.
it: guasto simultaneo ottimistico, oggetto è stato modificato.
ja: オプティミスティック同時実行の失敗は、オブジェクトが変更されました。
ko: 낙관적 동시성 실패, 개체가 수정되었습니다.
pt_br: Falha de concorrência otimista, objeto foi modificado.

source: Passwords must be at least {0} characters.
ar: يجب أن تكون كلمات المرور {0} على الأقل من الأحرف.
de: Passwörter müssen aus mindestens {0} Zeichen bestehen.
fr: Les mots de passe doivent être au moins {0} caractères.
hi: पासवर्ड कम से कम {0} अक्षरों का होना चाहिए।
hu: Jelszavak legalább {0} karakter.
it: Le password devono essere almeno {0} caratteri.
ja: パスワードは、少なくとも{0}文字でなければなりません。
ko: 암호는 적어도 {0} 자 여야합니다.
pt_br: As senhas devem ter pelo menos {0} caracteres.

source: Passwords must have at least one digit ('0'-'9').
ar: يجب أن تحتوي كلمات المرور على رقم واحد على الأقل ('0' - '9').
de: Passwörter müssen mindestens eine Ziffer haben ('0' - '9').
fr: Les mots de passe doivent comporter au moins un chiffre ( « 0 » - « 9 »).
hi: पासवर्ड कम से कम एक अंकों (- '9' '0') होना चाहिए।
hu: Jelszavak kell legalább egy számjegyet ( „0” - „9”).
it: Le password devono avere almeno una cifra ( '0' - '9').
ja: パスワードは少なくとも1桁（ - 「9」、「0」）を持っている必要があります。
ko: 암호는 적어도 하나 개의 숫자 (- '9' '0')가 있어야합니다.
pt_br: As senhas devem ter pelo menos um dígito ('0'-'9').

source: Passwords must have at least one lowercase ('a'-'z').
ar: يجب أن تحتوي كلمات المرور على حرف صغير واحد على الأقل ('a' - 'z').
de: Passwörter müssen mindestens einen Kleinbuchstaben ('a' - 'z') haben.
fr: Les mots de passe doivent avoir au moins une minuscule ( « a » - « z »).
hi: पासवर्ड कम से कम एक छोटे अक्षरों (- 'z' 'एक') होना चाहिए।
hu: Jelszavak kell legalább egy kisbetűs ( „a” - „z”).
it: Password devono avere almeno un minuscola ( 'un' - 'z').
ja: パスワードは、少なくとも一つの小文字（ - Z「」「A」）を有していなければなりません。
ko: 비밀번호는 적어도 하나의 소문자 (- ', Z' '는')를 가져야한다.
pt_br: As senhas devem ter pelo menos uma letra minúscula ('a'-'z').

source: Passwords must have at least one non alphanumeric character.
ar: يجب أن تحتوي كلمات المرور على حرف غير أبجدي رقمي واحد على الأقل.
de: Passwörter müssen mindestens ein nicht alphanumerisches Zeichen enthalten.
fr: Les mots de passe doivent avoir au moins un caractère non alphanumérique.
hi: पासवर्ड कम से कम एक गैर अक्षरांकीय वर्ण होना चाहिए।
hu: A jelszó legalább egy nem alfanumerikus karaktert.
it: Le password devono avere almeno un carattere non alfanumerico.
ja: パスワードには少なくとも1つの非英数字を持っている必要があります。
ko: 암호는 적어도 하나 개의 비 영숫자 문자가 있어야합니다.
pt_br: As senhas devem ter pelo menos um caractere não alfanumérico.

source: Passwords must have at least one uppercase ('A'-'Z').
ar: يجب أن تحتوي كلمات المرور على حرف كبير واحد على الأقل ("A" - "Z").
de: Passwörter müssen mindestens einen Großbuchstaben ('A' - 'Z') haben.
fr: Les mots de passe doivent avoir au moins une majuscule ( « A » - « Z »).
hi: पासवर्ड कम से कम एक अपरकेस (- 'Z' 'ए') होना आवश्यक है।
hu: Jelszavak kell legalább egy nagybetűs ( „A” - „Z”).
it: Le password devono avere almeno un maiuscola ( 'A' - 'Z').
ja: パスワードは、少なくとも一つの大文字（ - 「Z」「A」）を有していなければなりません。
ko: 암호는 적어도 하나의 대문자 (- 'Z' 'A')를 가지고 있어야합니다.
pt_br: As senhas devem ter pelo menos uma letra maiúscula ('A'-'Z').

source: Passwords must use at least {0} different characters.
ar: يجب أن تستخدم كلمات المرور {0} أحرف مختلفة على الأقل.
de: Passwörter müssen mindestens {0} verschiedene Zeichen enthalten.
fr: Les mots de passe doivent utiliser au moins {0} caractères différents.
hi: पासवर्ड कम से कम {0} विभिन्न चरित्रों का उपयोग करना चाहिए।
hu: Jelszavak kell használni legalább {0} különböző karakter.
it: Le password devono utilizzare almeno {0} caratteri diversi.
ja: パスワードは、少なくとも{0}異なる文字を使用しなければなりません。
ko: 암호는 적어도 {0} 다른 문자를 사용해야합니다.
pt_br: As senhas devem usar pelo menos {0} caracter(es) diferente(s).

source: Price
ar: السعر
de: Preis
fr: Prix
hi: मूल्य
hu: Ár
it: Prezzo
ja: 価格
ko: 가격
pt_br: Preço

source: Recovery code redemption failed.
ar: فشل استرداد رمز الاسترداد.
de: Einlösung des Wiederherstellungscodes fehlgeschlagen.
fr: rachat de code de récupération a échoué.
hi: रिकवरी कोड मोचन विफल रहा है।
hu: Recovery kód beváltására nem sikerült.
it: codice di recupero di riscatto non è riuscita.
ja: 回復コードの償還に失敗しました。
ko: 복구 코드 사용에 실패했습니다.
pt_br: Código de recuperação falhou.

source: Role name '{0}' is already taken.
ar: اسم الدور '{0}' مسجل مسبقاً.
de: Der Rollenname '{0}' ist bereits vergeben.
fr: Nom du rôle « {0} » est déjà pris.
hi: भूमिका का नाम '{0}' पहले से ही लिया जाता है।
hu: Szerep nevét „{0}” már foglalt.
it: Nome del ruolo '{0}' è già stato preso.
ja: ロール名「{0}」は既に取られます。
ko: 역할 이름 '{0}'이 (가) 이미 취해진 다.
pt_br: Nome da função '{0}' já está em uso.

source: Role name '{0}' is invalid.
ar: Rol adı '{0}' geçerli değildir.
de: Der Rollenname '{0}' ist ungültig.
fr: Nom du rôle « {0} » est invalide.
hi: भूमिका का नाम '{0}' अमान्य है।
hu: Szerep nevét „{0}” érvénytelen.
it: Nome del ruolo '{0}' non è valido.
ja: ロール名は「{0}」は無効です。
ko: 역할 이름은 '{0}'이 (가) 잘못되었습니다.
pt_br: Nome da função '{0}' é inválido.

source: The argument '{0}' cannot be null, empty or contain only whitespace.
ar: لا يمكن أن تكون الوسيطة '{0}' خالية أو فارغة أو تحتوي على مسافة بيضاء فقط.
de: Das Argument '{0}' darf nicht null, leer oder nur Leerzeichen enthalten.
fr: L'argument « {0} » ne peut pas être nulle, vide ou contenir que des espaces.
hi: तर्क '{0}', अशक्त खाली नहीं हो या इसमें केवल रिक्त हो सकते हैं।
hu: Az érvelés „{0}” nem lehet null, üres, vagy tartalmazhat csak szóközöket.
it: L'argomento '{0}' non può essere nullo, vuoto o contenere solo spazi bianchi.
ja: 引数は、「{0}」が空、ヌルであるかのみ空白を含めることはできません。
ko: 인수는 '{0}', null이 비어 있거나 공백 만 포함 할 수 없습니다.
pt_br: O argumento '{0}' não pode ser nulo, vazio ou conter apenas espaços em branco.

source: The associated metadata type for type '{0}' contains the following unknown properties or fields: {1}. Please make sure that the names of these members match the names of the properties on the main type.
ar: يحتوي نوع البيانات الوصفية المرتبطة بالنوع '{0}' على الخصائص أو الحقول غير المعروفة التالية: {1}. يرجى التأكد من أن أسماء هؤلاء الأعضاء تتطابق مع أسماء الخصائص على النوع الرئيسي.
de: Der zugeordnete Metadatentyp für den Typ '{0}' enthält die folgenden unbekannten Eigenschaften oder Felder: {1}. Stellen Sie sicher, dass die Namen dieser Mitglieder mit den Namen der Eigenschaften des Haupttyps übereinstimmen.
fr: Le type de métadonnées associées pour le type « {0} » contient les propriétés suivantes inconnues ou des champs: {1}. S'il vous plaît assurez-vous que les noms de ces membres correspondent aux noms des propriétés du type principal.
hi: प्रकार के लिए संबद्ध मेटाडेटा प्रकार '{0}' अज्ञात गुण या क्षेत्रों में निम्नलिखित शामिल हैं: {1}। कृपया सुनिश्चित करें कि इन सदस्यों के नाम मुख्य प्रकार पर संपत्तियों की नाम से मेल कर सकते हैं।
hu: A kapcsolódó metaadat-típus típus „{0}” tartalmazza a következő ismeretlen tulajdonságokkal vagy mezők: {1}. Kérjük, győződjön meg róla, hogy a nevét ezek a tagok megegyeznek a nevét a tulajdonságok a fő típusát.
it: Il tipo di metadati associati per il tipo '{0}' contiene le seguenti proprietà sconosciute o campi: {1}. Si prega di fare in modo che i nomi di questi membri corrispondono ai nomi delle proprietà del tipo principale.
ja: タイプの関連メタデータタイプ「{0}」は、以下の未知のプロパティまたはフィールドが含まれています：{1}。これらのメンバーの名前は、メイン・タイプのプロパティの名前と一致していることを確認してください。
ko: 유형에 대한 관련 메타 데이터 형식 '{0}'다음 알 수없는 속성 또는 필드를 포함합니다 : {1}. 이 멤버의 이름이 주요 유형에 속성의 이름과 일치하는지 확인하십시오.
pt_br: O tipo de metadados associado para o tipo '{0}' contém as seguintes propriedades ou campos desconhecidos: {1}. Por favor, certifique-se de que os nomes desses membros coincidem com os nomes das propriedades do tipo principal.

source: The custom DataType string cannot be null or empty.
ar: لا يمكن أن تكون سلسلة DataType المخصصة خالية أو فارغة.
de: Die benutzerdefinierte DataType-Zeichenfolge darf nicht null oder leer sein.
fr: La chaîne DataType personnalisée ne peut être nul ou vide.
hi: कस्टम डेटा प्रकार स्ट्रिंग शून्य या खाली नहीं हो सकता।
hu: Az egyéni DataType karakterlánc nem lehet üres.
it: La stringa TipoDati personalizzato non può essere nullo o vuoto.
ja: カスタムデータ型の文字列がnullまたは空にすることはできません。
ko: 사용자 정의 데이터 형식 문자열은 null 또는 비어있을 수 없습니다.
pt_br: A cadeia de caracteres do DataType personalizado não pode ser nula ou vazia.

source: The custom validation type '{0}' must be public.
ar: يجب أن يكون نوع التحقق المخصص '{0}' عامًا.
de: Der benutzerdefinierte Überprüfungstyp '{0}' muss öffentlich sein.
fr: Le type de validation personnalisée '{0}' doit être public.
hi: कस्टम सत्यापन प्रकार '{0}' सार्वजनिक होना चाहिए।
hu: Az egyéni érvényesítési típus „{0}” kell lennie nyilvános.
it: Il tipo di convalida personalizzato '{0}' deve essere pubblico.
ja: カスタム検証型「{0}」はパブリックでなければなりません。
ko: 사용자 정의 유효성 검사 유형은 '{0}'공개해야합니다.
pt_br: O tipo de validação personalizada '{0}' deve ser pública.

source: The CustomValidationAttribute method '{0}' does not exist in type '{1}' or is not public and static.
ar: طريقة CustomValidationAttribute '{0}' غير موجودة في النوع '{1}' أو ليست عامة وثابتة.
de: Die CustomValidationAttribute-Methode '{0}' ist im Typ '{1}' nicht vorhanden oder nicht öffentlich und statisch.
fr: La méthode CustomValidationAttribute « {0} » n'existe pas dans le type « {1} » ou non publique et statique.
hi: CustomValidationAttribute विधि '{0}' प्रकार में मौजूद नहीं है '{1}' या सार्वजनिक और स्थिर नहीं है।
hu: A CustomValidationAttribute módszer „{0}” nem létezik a típusú „{1}”, vagy nem nyilvános és statikus.
it: Il metodo CustomValidationAttribute '{0}' non esiste nel tipo '{1}' o non è pubblico e statico.
ja: CustomValidationAttribute方法は、「{0}」型に存在しない「{1}」又は公衆及び静的ではありません。
ko: CustomValidationAttribute 방법 '{0}'형태로 존재하지 않는다 '는 {1} 또는 공용 정적이 아니다.
pt_br: O método CustomValidationAttribute '{0}' não existe no tipo '{1}' ou não é público e estático.
