Repository: LazZiya/ExpressLocalizationSampleCore3
Catalog: ExpressLocalizationSampleCore3/LocalizationResources/ExpressLocalizationResource.*.resx
Languages: ar, de, fr, hi, hu, it, ja, ko, pt_br

source: The type {0} must implement {1}.
ar: يجب على النوع {0} أن يطبق النوع {1}.
de: Der Typ {0} muss {1} implementieren.
fr: Le type {0} doit mettre en œuvre {1}.
hi: प्रकार {0} को लागू करना चाहिए {1}।
hu: A {0} típusú kell végrehajtani {1}.
it: Il tipo {0} deve implementare {1}.
ja: タイプ{0}は{1}を実装しなければなりません。
ko: 유형은 {0} 구현해야합니다 {1}.
pt_br: O tipo {0} deve implementar {1}.

source: The value '{0}' is invalid.
ar: القيمة '{0}' غير صالحة.
de: Der Wert "{0}" ist ungültig.
fr: La valeur « {0} » est invalide.
hi: मान '{0}' अमान्य है।
hu: Az érték „{0}” érvénytelen.
it: Il valore '{0}' non è valido.
ja: 値は{0}は無効です。
ko: 값은 '{0}'이 (가) 잘못되었습니다.
pt_br: O valor '{0}' é inválido.

source: The value '{0}' is not valid for {1}.
ar: القيمة '{0}' غير صالحة لـ {1}.
de: Der Wert '{0}' ist für {1} nicht gültig.
fr: La valeur '{0}' est pas valide pour {1}.
hi: मान '{0}' के लिए मान्य नहीं है {1}।
hu: Az érték '{0}' nem érvényes {1}.
it: Il valore '{0}' non è valida per {1}.
ja: 値は{0}、{1}には無効です。
ko: 값은 '{0}에 대해 유효하지 않은 {1}.
pt_br: O valor '{0}' não é válido para {1}.

source: The value '{0}' is not valid.
ar: القيمة '{0}' غير صالحة.
de: Der Wert '{0}' ist ungültig.
fr: La valeur « {0} » est pas valide.
hi: मान '{0}' मान्य नहीं है।
hu: Az érték „{0}” nem érvényes.
it: Il valore '{0}' non è valido.
ja: 値は「{0}」は有効ではありません。
ko: 값은 '{0}'유효하지 않습니다.
pt_br: O valor '{0}' não é válido.

source: The value for property '{0}' must be of type '{1}'.
ar: يجب أن تكون قيمة الخاصية '{0}' من النوع '{1}'.
de: Der Wert für die Eigenschaft '{0}' muss vom Typ '{1}' sein.
fr: La valeur de la propriété '{0}' doit être de type '{1}'.
hi: संपत्ति के लिए मूल्य '{0}' प्रकार का होना चाहिए '{1}'।
hu: Az érték a tulajdon „{0}” típusú legyen „{1}”.
it: Il valore per la proprietà '{0}' deve essere di tipo '{1}'.
ja: プロパティの値は、「{0}」タイプ「{1}」でなければなりません。
ko: 속성 값은 '{0} 유형이어야'{1}.
pt_br: O valor para a propriedade '{0}' deve ser do tipo '{1}'.

source: The {0} field is not a valid credit card number.
ar: الحقل {0} ليس رقم بطاقة ائتمان صالحًا.
de: Das Feld {0} ist keine gültige Kreditkartennummer.
fr: Le champ {0} n'est pas un numéro de carte de crédit valide.
hi: {0} फ़ील्ड में कोई मान्य क्रेडिट कार्ड नंबर नहीं है।
hu: A {0} mező nem érvényes hitelkártya számát.
it: Il campo {0} non è un numero di carta di credito valida.
ja: {0}フィールドには有効なクレジットカード番号ではありません。
ko: 은 {0} 필드는 유효한 신용 카드 번호가 아닙니다.
pt_br: O campo {0} não é um número de cartão de crédito válido.

source: The {0} field is not a valid e-mail address.
ar: الحقل {0} ليس عنوان بريد إلكتروني صالحًا.
de: Das Feld {0} ist keine gültige E-Mail-Adresse.
fr: {0} champ n'est pas une adresse e-mail valide.
hi: {0} फ़ील्ड में एक मान्य ई-मेल एड्रेस नहीं है।
hu: A {0} mező nem egy érvényes e-mail címet.
it: Il campo {0} non è un indirizzo e-mail valido.
ja: {0}フィールドは、有効な電子メールアドレスではありません。
ko: 은 {0} 필드는 유효한 이메일 주소가 아닙니다.
pt_br: O campo {0} não é um endereço de e-mail válido.

source: The {0} field is not a valid fully-qualified http, https, or ftp URL.
ar: الحقل {0} ليس عنوان URL صالحًا بالكامل أو http أو https أو ftp.
de: Das Feld {0} ist keine gültige vollqualifizierte http-, https- oder ftp-URL.
fr: {0} champ n'est pas entièrement qualifié valide http, https ou ftp URL.
hi: {0} क्षेत्र http, https, या ftp URL को मान्य पूरी तरह से योग्य नहीं है।
hu: A {0} mező nem érvényes teljesen minősített http, https vagy ftp URL-t.
it: Il campo {0} non è una valida fully-qualified http, https, o un URL ftp.
ja: {0}フィールドは、HTTP、HTTPS、またはFTP URLの有効な完全修飾ではありません。
ko: 은 {0} 필드는 HTTP, HTTPS 또는 FTP URL 유효한 완전한 아닙니다.
pt_br: O campo {0} não é uma url http, https ou ftp válida.

source: The {0} field is not a valid phone number.
ar: الحقل {0} ليس رقم هاتف صالحًا.
de: Das Feld {0} ist keine gültige Telefonnummer.
fr: Le champ {0} est pas un numéro de téléphone valide.
hi: {0} क्षेत्र एक मान्य फ़ोन नंबर नहीं है।
hu: A {0} mező nem érvényes telefonszámot.
it: Il campo {0} non è un numero di telefono valido.
ja: {0}フィールドは、有効な電話番号ではありません。
ko: 은 {0} 필드는 유효한 전화 번호가 아닙니다.
pt_br: O campo {0} não é um número de telefone válido.

source: The {0} field is required.
ar: الحقل {0} مطلوب.
de: Das Feld {0} ist erforderlich.
fr: Le champ {0} est nécessaire.
hi: {0} फ़ील्ड आवश्यक है।
hu: A {0} a területen van szükség.
it: È necessario il campo {0}.
ja: {0}フィールドが必要です。
ko: 은 {0} 필드는 필수입니다.
pt_br: O campo {0} é obrigatório.

source: The {0} field only accepts files with the following extensions: {1}
ar: يقبل الحقل {0} فقط الملفات ذات الملحقات التالية: {1}
de: Das Feld {0} akzeptiert nur Dateien mit den folgenden Erweiterungen: {1}
fr: {0} champ accepte uniquement les fichiers avec les extensions suivantes: {1}
hi: {0} क्षेत्र केवल निम्नलिखित एक्सटेंशन के साथ फ़ाइलों को स्वीकार करता है: {1}
hu: A {0} mezőbe csak az fájlokat a következő kiterjesztések: {1}
it: Il campo {0} accetta solo i file con le seguenti estensioni: {1}
ja: {1}：{0}フィールドは、以下の拡張子を持つファイルを受け付けます
ko: 은 {0} 필드는 다음과 같은 확장자를 가진 파일을 허용 : {1}
pt_br: O {0} campo só aceita arquivos com as seguintes extensões: {1}

source: The {0} property has not been set. Use the {1} method to get the value.
ar: لم يتم تعيين الخاصية {0}. استخدم الطريقة {1} للحصول على القيمة.
de: Die Eigenschaft {0} wurde nicht festgelegt. Verwenden Sie die Methode {1}, um den Wert abzurufen.
fr: La propriété {0} n'a pas été défini. Utilisez la méthode {1} pour obtenir la valeur.
hi: {0} गुण सेट नहीं किया गया है। {1} विधि का उपयोग करें मूल्य मिलता है।
hu: A {0} tulajdonság nem lett beállítva. A {1} a módszert, hogy az értéket.
it: Il {0} proprietà non è stata impostata. Utilizzare il metodo {1} per ottenere il valore.
ja: {0}プロパティが設定されていません。値を取得する{1}メソッドを使用します。
ko: 은 {0} 속성이 설정되지 않았습니다. 값을 얻기 위해 {1} 방법을 사용합니다.
pt_br: A propriedade {0} não foi definida. Use o método {1} para obter o valor.

source: User already has a password set.
ar: المستخدم لديه كلمة مرور موضوعة مسبقاً.
de: Der Benutzer hat bereits ein Passwort festgelegt.
fr: L'utilisateur dispose déjà d'un mot de passe défini.
hi: उपयोगकर्ता पहले से ही एक पासवर्ड सेट है।
hu: Felhasználónak már van beállított jelszóval.
it: L'utente ha già una password impostata.
ja: ユーザーは、すでにパスワードが設定されています。
ko: 사용자가 이미 암호 세트가 있습니다.
pt_br: Usuário já tem uma senha definida.

source: User already in role '{0}'.
ar: المستخدم موجود في الدور '{0}' مسبقاً.
de: Benutzer ist bereits in der Rolle "{0}".
fr: Utilisateur déjà dans le rôle de « {0} ».
hi: पहले से ही भूमिका में उपयोगकर्ता '{0}'।
hu: A felhasználó már szerepe „{0}”.
it: Utente già in ruolo '{0}'.
ja: 既に役割におけるユーザ{0}。
ko: 이미 역할의 사용자 '{0}'.
pt_br: Usuário já pertence ao papel de '{0}'.

source: User is not in role '{0}'.
ar: المستخدم ليس في الدور '{0}'.
de: Der Benutzer ist nicht in der Rolle "{0}".
fr: L'utilisateur est pas dans le rôle « {0} ».
hi: उपयोगकर्ता भूमिका में नहीं है '{0}'।
hu: Felhasználó nincs szerepe „{0}”.
it: L'utente non fa parte '{0}'.
ja: ユーザは、役割「{0}」ではありません。
ko: 사용자 역할에없는 '{0}'.
pt_br: Usuário não pertence ao papel '{0}'.

source: User name '{0}' is already taken.
ar: اسم المستخدم '{0}' مسجل مسبقاَ.
de: Der Benutzername '{0}' ist bereits vergeben.
fr: Nom d'utilisateur « {0} » est déjà pris.
hi: उपयोगकर्ता नाम '{0}' पहले से ही लिया जाता है।
hu: Felhasználó név „{0}” már foglalt.
it: Nome utente '{0}' è già stato preso.
ja: ユーザ名「{0}」は既に取られます。
ko: 사용자 이름 '{0}'이 (가) 이미 취해진 다.
pt_br: Nome de usuário '{0}' já está em uso.

source: User name '{0}' is invalid, can only contain letters or digits.
ar: اسم المستخدم '{0}' غير صالح ، يمكن أن يحتوي فقط على أحرف أو أرقام.
de: Der Benutzername '{0}' ist ungültig und darf nur Buchstaben oder Ziffern enthalten.
fr: Nom d'utilisateur « {0} » est invalide, ne peut contenir que des lettres ou des chiffres.
hi: उपयोगकर्ता नाम '{0}' अमान्य है, केवल अक्षर या अंक हो सकते हैं।
hu: Felhasználó név „{0}” érvénytelen, csak betűket vagy számjegyeket.
it: Nome utente '{0}' non è valido, può contenere solo lettere o cifre.
ja: ユーザ名は「{0}」、無効であるのみ文字または数字を含むことができます。
ko: 사용자 이름이 '{0}'이 (가) 유효하지 않은 경우에만 문자 또는 숫자를 포함 할 수 있습니다.
pt_br: Nome de usuário '{0}' é inválido, somente pode conter letras ou dígitos.

source: {0} is not valid.
ar: {0} غير صالح.
de: {0} ist ungültig.
fr: {0} n'est pas valide.
hi: {0} मान्य नहीं है।
hu: {0} nem érvényes.
it: {0} non è valido.
ja: {0}は有効ではありません。
ko: {0} 유효하지 않습니다.
pt_br: {0} não é válido.

source: Confirm password
ar: تأكيد كلمة المرور
de: Passwort bestätigen
fr: Confirmez le mot de passe
hi: पासवर्ड की पुष्टि कीजिये
hu: Jelszó megerősítése
it: Conferma password
ja: パスワードを認証する
ko: 비밀번호 확인
pt_br: Confirme a senha

source: Email
ar: البريد الالكتروني
hi: ईमेल
ja: Eメール
ko: 이메일

source: Password
ar: كلمة المرور
de: Passwort
fr: Mot de passe
hi: पारण शब्द
hu: Jelszó
it: Parola d'ordine
ja: パスワード
ko: 암호
pt_br: Senha

source: Current password
ar: كلمة المرور الحالية
de: Aktuelles Passwort!
fr: Mot de passe actuel!
hi: वर्तमान पासवर्ड!
hu: Jelenlegi jelszó!
it: Password corrente!
ja: 現在のパスワード
ko: 현재 비밀번호!
pt_br: Senha atual

source: New password
ar: كلمة المرور الجديدة
fr: Nouveau mot de passe.
hi: नया पासवर्ड!
hu: Új jelszó!
it: Nuova Password
ja: 新しいパスワード
ko: 새 암호!
pt_br: Nova senha

source: Phone number
ar: رقم الهاتف
de: Telefonnummer:
fr: gsm
hi: टेलिफोन क्रमांक
hu: Telefonszám!
it: N. Cellulare
ja: 電話番号
pt_br: Número de telefone

source: User name
ar: اسم المستخدم
de: Benutzername
fr: identifiant
hi: उपयोक्ता नाम
hu: & Felhasználónév:
ja: over interface
ko: 로그인 사용자
pt_br: Nome de usuário

source: Verification code
ar: رمز التأكيد
de: Bestätigungscode
fr: Code de confirmation!
hi: पुष्टि कोड!
hu: Megerősítési kód!
it: Conferma
ja: 確認コード
ko: 확인 코드!
pt_br: Código de confirmação

source: Remember me
ar: تذكرني
fr: Ne m'oublie pas.
hi: मुझे याद करो!
hu: Emlékezz rám!
it: Ricordami
ja: 私を覚えている！
ko: 나를 기억해!
pt_br: Lembrar de mim

source: Remember this machine?
ar: تدكر هذا الجهاز؟
de: Erinnerst du dich an dieses Gerät ?!
fr: Vous souvenez-vous de cet appareil?!
hi: क्या आपको यह डिवाइस याद है!
hu: Emlékszik erre az eszközre?
it: Ti ricordi questo dispositivo ?!
ja: あなたはこの装置を覚えていますか？
ko: 이 장치를 기억하나요?!
pt_br: Você se lembra deste dispositivo?

source: Confirm new password
ar: تأكيد كلمة المرور الجديدة
fr: Confirmer le nouveau mot de passe.
hi: अपने नए पासवर्ड की पुष्टि करें!
hu: Erősítse meg új jelszavát!
it: Conferma la tua nuova password!
ja: 新しいパスワードを確認してください。
ko: 새 암호를 확인하십시오!
pt_br: Confirme sua nova senha
